[
  {
    "title": "OtO at a glance",
    "content": "svelte:head <link rel=\"canonical\" href=\"https://documentation.oto.software/\"> </svelte:head> # OtO at a glance OtO at a glance, Registration, update This offline version may not be 100% up to date. Get the latest version at https://documentation.oto.software <ImageZoom url={'/interface.webp'} /> admonition type=tip If the Show Tooltips option is enabled in Settings Panel (Options Menu then ⚙ Settings, or ), you can hover your mouse over any button in the interface to display a tooltip that will remind you of the button's associated function. !! !! !! !! !! !! !! ## Recommanded specifications - For PC: - Operating system: Windows 10, version 1607 - CPU: Recent x86-64 processor (Intel/AMD) - RAM: 8+GB (16gb recommended) - GPU (optional for faster performance): NVIDIA GPU with CUDA support (e.g., GTX 1050 or better) - Storage: SSD (for faster model loading) - For Mac: - Operating system: macOS 10.15 (Catalina) - CPU: Apple Silicon (M1/M2) or Intel Mac - RAM: 8GB",
    "slug": "docs/oto-basics/get-started"
  },
  {
    "title": "Recommanded specifications",
    "content": "For PC: Operating system: Windows 10, version 1607 CPU: Recent x86-64 processor (Intel/AMD) RAM: 8+GB (16gb recommended) GPU (optional for faster performance): NVIDIA GPU with CUDA support (e.g., GTX 1050 or better) Storage: SSD (for faster model loading) For Mac: Operating system: macOS 10.15 (Catalina) CPU: Apple Silicon (M1/M2) or Intel Mac RAM: 8GB",
    "slug": "docs/oto-basics/get-started#recommanded-specifications"
  },
  {
    "title": "Licensing and updates",
    "content": "Licensing and updates ## Registration When you open OtO, you will see this registration module: - If you already have a license, fill in the necessary fields and click \"Register.\" Note that your serial number is tied to a security key present on your computer. You can reinstall OtO on another computer if necessary, but you should not use the same license on multiple computers simultaneously. Doing so may result in your license being permanently deactivated. - You can obtain a free or paid license by clicking the \"Buy License\" button or visiting https://oto.software#licensing. ## OtO Demo The free demo versions allows you to test all features from every OtO flavour. It's unlimited in time and only displays a watermark in the Prompter Panel region as well as in the external window. It will also triggers a gentle popup reminder to support OtO from time to time. ## Changing Your License You can deactivate your current license at any time to activate a new one. Here's how: - Go to the Help menu and click Disable your OtO license. - Restart the application to display the registration module again. ## Moving to another computer You can move your license to another computer at any time. Just follow the steps above to deactive your license first on the first computer, and reactivate it after installing OtO on the other computer. ## Updating To update, just click the Help Menu then Check For updates, and install the suggested update if one is available",
    "slug": "docs/oto-basics/licensing"
  },
  {
    "title": "Registration",
    "content": "When you open OtO, you will see this registration module: If you already have a license, fill in the necessary fields and click \"Register.\" Note that your serial number is tied to a security key present on your computer. You can reinstall OtO on another computer if necessary, but you should not use the same license on multiple computers simultaneously. Doing so may result in your license being permanently deactivated. You can obtain a free or paid license by clicking the \"Buy License\" button or visiting https://oto.software#licensing.",
    "slug": "docs/oto-basics/licensing#registration"
  },
  {
    "title": "OtO Demo",
    "content": "The free demo versions allows you to test all features from every OtO flavour. It's unlimited in time and only displays a watermark in the Prompter Panel region as well as in the external window. It will also triggers a gentle popup reminder to support OtO from time to time.",
    "slug": "docs/oto-basics/licensing#oto-demo"
  },
  {
    "title": "Changing Your License",
    "content": "You can deactivate your current license at any time to activate a new one. Here's how: Go to the Help menu and click Disable your OtO license. Restart the application to display the registration module again.",
    "slug": "docs/oto-basics/licensing#changing-your-license"
  },
  {
    "title": "Moving to another computer",
    "content": "You can move your license to another computer at any time. Just follow the steps above to deactive your license first on the first computer, and reactivate it after installing OtO on the other computer.",
    "slug": "docs/oto-basics/licensing#moving-to-another-computer"
  },
  {
    "title": "Updating",
    "content": "To update, just click the Help Menu then Check For updates, and install the suggested update if one is available",
    "slug": "docs/oto-basics/licensing#updating"
  },
  {
    "title": "Editing text",
    "content": "Editing text OtO simplifies the process of editing and managing text for prompter / cued presentations, allowing you to efficiently import, format, and control documents with ease. Whether you're importing content from a .docX file or fine-tuning the formatting within the editor, OtO provides a flexible and intuitive interface designed for professional use. In the following chapters, you'll learn how to import and edit documents, adjust formatting, use prompter mode, and work with markers—all essential skills for mastering OtO's text-editing features. Let's dive in! ## Importing Documents - OtO can import any .docX file. To do so, Either click on the toolbar icon or click on the File then \"Import docX\" menu. - You can also Copy → Paste text content from any third-party software though we strongly suggest the .docX import way (less prone to formatting issues) - You can select and open multiple files at once, they will appear in the Rundown / Document list panel . - To save your new project, just click on the toolbar icon or click on the File then \"save\" or \"save as\"shortcut item and enter a name for your project, it will create a file with a _.prompt_ extension at the selected location. - You can also import a project within an existing project by cliking on ***File*** menu then ***\"Import project\"*** menu item, which will basically merge the imported project with your current project. type=tip You may also use keyboard shortcuts(click on the ***File*** menu to see the shortcut for some of the above commands) ## Editing Documents - OtO offers basic text processing features, such as bold, italic, colors, and highlighting, as well as font size and font family selection . Simply select the text you want to format and click the corresponding button on the toolbar. ![OtO Toolbar](/toolbar-noprompting.jpg) - When it comes to font selection , and font size, OtO takes a slightly different approach compared to traditional word processors to better suit the needs of teleprompter presentations. By default, changes made in either of these menus will apply to the entire current document. You can modify this behavior by using the *\"Apply to\"* dropdown in the font or size selection menu, where you can choose to apply changes to selected documents (use the rundown panel checkboxes to select multiple documents), all documents, or just the selected text. ![Applying to selected documents](/apply-to.jpg) - For color selection, the \"Hilite\" button acts as a toggle: when activated, the chosen color is applied as a highlight. This allows you to quickly apply both a color and a highlight from the same menu. Additionally, keyboard shortcutsCTRL+ALT+1 (⌘+ALT+1on mac) throughCTRL+ALT+5allow you to directly apply one of the first five colors (the same as in the dropdown menu), and theCTRL+ALT+Hshortcut applies a predefined highlight. ![OtO Color Selection tool](/color-selection.jpg) - You can also **remove any previous formatting** by clicking the button. ## Mini Editor You may have already noticed that OtO provides two editing windows: the _Prompter Editor_ Panel , and the _mini editor_ . Every time you enter text in the _Prompter Editor_, the text is updated in the _mini-editor_ and vice versa. The top portion of the prompter editor displays exactly what the speaker sees on the external screen. This is the **\"Prompter Safe View\"**, However, since the font size in this view is often very large, editing text directly can be cumbersome. Additionally, it’s difficult to anticipate upcoming text or get a comprehensive overview of the content. This is where the _mini-editor_ comes in handy—it's a preview panel which allows you to easily navigate through the document, get an overview of the text ahead, and work on other sections without affecting the prompter screen. type=info When you scroll within the mini-editor, it does not move the prompter display, allowing the speaker to stay focused on their current section while the operator works elsewhere. This secondary editing window gives you the freedom to manage the text without disturbing the speaker’s flow, providing a powerful tool for operators. Here’s how you can make the most of it: - The mini-editor allows you to preview and navigate through the upcoming text while in [prompter mode](/docs/oto-basics/prompting). You can scroll through the mini-editor without affecting the current position of the prompter screen, ensuring the speaker’s view remains uninterrupted. - You can even edit the text directly in the mini-editor. However, be cautious—if you modify any text that appears before the speaker’s current position, the prompter will adjust and shift by a few lines. - For added convenience, you can Sync (or rather “link”) the scrolling of the mini-editor to the Prompter Editor Panel by clicking the button. This creates a *one-way sync*, ensuring that what is displayed in the mini-editor matches what is shown in the Prompter Editor panel. type=info When lost between the two editing panels ( and ), you can easiliy find your way back by selecting one or several words in the _Prompter Editor_ or the _mini-editor_ before clicking the button , OtO will find the same selection in its counterpart editor. type=tip If you're using OtO as a presentation helper tool rather than a teleprompting tool, you can enlarge the black **\"Prompter Safe View\"** to the whole Editor Panel by setting the Aspect Ratio Setting in⚙ Settings→Generalto \"disable\" ## Rundown Panel For a comprehensive overview of all the features available in this panel, refer to the [dedicated chapter](/docs/oto-basics/rundown). In the meantime, here's a brief introduction: - the _Rundown_ panel displays a list of all imported project documents. - You can select multiple documents using the checkboxes beside each document. - The topmost checkbox allows you to select all documents at once. - The active document (the one currently scrolling in the _Prompter Editor_ is signaled with a red dot ). - Notice the current document progress indicator (not to be confused with the global progress indicator) ![progress](/search.webp) ## Markers For a full understanding of OtO's powerful marker system, make sure to read the [main chapter](/docs/markers/standard-markers) and its sub-sections. However, here's a quick guide to get you started: The _Markers_ sub-panel keeps track of markers (which function like bookmarks). You can toggle the visibility of this sub-panel by clicking the button. - To **create** a marker, select a short piece of text (1 to 3 words) in either the _mini-editor_ or the _Prompter Editor_ Panel and click the toolbar button (orCTRL+Mor⌘+Mon mac). If you create a marker on text that already has one, doing this again will **remove** the existing marker. - To **jump** (scroll) to a marker, click the button next to the marker in the _Markers_ sub-panel . This will scroll either the _mini-editor_ or the _Prompter Editor_ Panel to that marker, depending on which one was last active (the one you were actually using). - To **delete** a marker, double-click the icon (this is designed to prevent accidental deletions), or *right-click* on it and select *\"Remove Marker\"* type=info Markers are a key feature of OtO, and we strongly recommend reading the [dedicated chapters](/docs/markers/standard-markers) to fully leverage their potential. ## Setting Margins and Offsets ![margins](/margins.jpg) Clicking on the icon in the toolbar opens the **margins** dropdown which allows you to adjust the following settings across all documents within the current OtO project: - **Left and right margins** (useful for adapting to screens or monitors that don’t display 100% of the image), specified in pixels. - **Line height** as a percentage, to control line spacing. - **Vertical offset of Action Markers**, specified in pixels.<br> This last parameter enables you to trigger Action Markers slightly earlier (negative values) or slightly later (positive values) based on the number of pixels you enter. #### **Important:** These values are saved within each specific OtO project, meaning they will not carry over to other projects, unlike a generalSetting. However, you can set **default** values for these adjustments by going to:<br> - ⚙ Settings→General→Default safe text marginsfor left and right margins. -⚙ Settings→General→Default Font Settingsfor line height. -⚙ Settings→Markers and Timers→Action Marker Vertical Offset in Pixelsfor the default marker offset. type=\"warning\" - The⚙ Settings→Markers and Timers→Action Marker Vertical Offset in Pixelssetting for default marker offset should not be confused with theScroll Offset ▶ cue indicatorsetting, which controls the offset (in pixels) when navigating between markers ## Languages and Scripts - **Alphabets:** <br> We’ve carefully selected several typefaces with various styles to cover all teleprompter readability needs across different languages and scripts. IBM Plex and its variants support over a hundred languages and more than seven alphabets, including Arabic, Cyrillic, Devanagari, Greek, Hebrew, Japanese, Korean, and Thai. Roboto covers Latin, Cyrillic, and Greek alphabets. Additionally, we’ve incorporated Noto SC for Simplified Chinese and Noto HK for Hong Kong Chinese. - **Script Directions:** <br> Script directionality is mostly automated. When you import a .docX document, notes from a PowerPoint, or even paste text, OtO will automatically detect whether the script is \"Left-to-Right\" or \"Right-to-Left.\" However, you can manually set the script’s language by right-clicking on the script line in the [Rundown Panel](/docs/oto-basics/rundown) or clicking...` at the end of the line and selecting Languages, as shown below.",
    "slug": "docs/oto-basics/editing"
  },
  {
    "title": "Importing Documents",
    "content": "OtO can import any .docX file. To do so, Either click on the toolbar icon or click on the File then \"Import docX\" menu. You can also Copy → Paste text content from any third-party software though we strongly suggest the .docX import way (less prone to formatting issues) You can select and open multiple files at once, they will appear in the Rundown / Document list panel . To save your new project, just click on the toolbar icon or click on the File then \"save\" or \"save as\"` shortcut item and enter a name for your project, it will create a file with a .prompt extension at the selected location. You can also import a project within an existing project by cliking on File menu then \"Import project\" menu item, which will basically merge the imported project with your current project. type=tip You may also use keyboard shortcuts(click on the File menu to see the shortcut for some of the above commands)",
    "slug": "docs/oto-basics/editing#importing-documents"
  },
  {
    "title": "Editing Documents",
    "content": "OtO offers basic text processing features, such as bold, italic, colors, and highlighting, as well as font size and font family selection . Simply select the text you want to format and click the corresponding button on the toolbar. When it comes to font selection , and font size, OtO takes a slightly different approach compared to traditional word processors to better suit the needs of teleprompter presentations. By default, changes made in either of these menus will apply to the entire current document. You can modify this behavior by using the \"Apply to\" dropdown in the font or size selection menu, where you can choose to apply changes to selected documents (use the rundown panel checkboxes to select multiple documents), all documents, or just the selected text. For color selection, the \"Hilite\" button acts as a toggle: when activated, the chosen color is applied as a highlight. This allows you to quickly apply both a color and a highlight from the same menu. Additionally, keyboard shortcuts CTRL+ALT+1 (⌘+ALT+1 on mac) through CTRL+ALT+5 allow you to directly apply one of the first five colors (the same as in the dropdown menu), and the CTRL+ALT+H shortcut applies a predefined highlight. You can also remove any previous formatting by clicking the button.",
    "slug": "docs/oto-basics/editing#editing-documents"
  },
  {
    "title": "Mini Editor",
    "content": "You may have already noticed that OtO provides two editing windows: the Prompter Editor Panel , and the mini editor . Every time you enter text in the Prompter Editor, the text is updated in the mini-editor and vice versa. The top portion of the prompter editor displays exactly what the speaker sees on the external screen. This is the \"Prompter Safe View\", However, since the font size in this view is often very large, editing text directly can be cumbersome. Additionally, it’s difficult to anticipate upcoming text or get a comprehensive overview of the content. This is where the mini-editor comes in handy—it's a preview panel which allows you to easily navigate through the document, get an overview of the text ahead, and work on other sections without affecting the prompter screen. type=info When you scroll within the mini-editor, it does not move the prompter display, allowing the speaker to stay focused on their current section while the operator works elsewhere. This secondary editing window gives you the freedom to manage the text without disturbing the speaker’s flow, providing a powerful tool for operators. Here’s how you can make the most of it: The mini-editor allows you to preview and navigate through the upcoming text while in prompter mode. You can scroll through the mini-editor without affecting the current position of the prompter screen, ensuring the speaker’s view remains uninterrupted. You can even edit the text directly in the mini-editor. However, be cautious—if you modify any text that appears before the speaker’s current position, the prompter will adjust and shift by a few lines. For added convenience, you can Sync (or rather “link”) the scrolling of the mini-editor to the Prompter Editor Panel by clicking the button. This creates a one-way sync, ensuring that what is displayed in the mini-editor matches what is shown in the Prompter Editor panel. type=info When lost between the two editing panels ( and ), you can easiliy find your way back by selecting one or several words in the Prompter Editor or the mini-editor before clicking the button , OtO will find the same selection in its counterpart editor. type=tip If you're using OtO as a presentation helper tool rather than a teleprompting tool, you can enlarge the black \"Prompter Safe View\" to the whole Editor Panel by setting the Aspect Ratio Setting in ⚙ Settings → General to \"disable\"",
    "slug": "docs/oto-basics/editing#mini-editor-number-n-4"
  },
  {
    "title": "Rundown Panel",
    "content": "For a comprehensive overview of all the features available in this panel, refer to the dedicated chapter. In the meantime, here's a brief introduction: the Rundown panel displays a list of all imported project documents. You can select multiple documents using the checkboxes beside each document. The topmost checkbox allows you to select all documents at once. The active document (the one currently scrolling in the Prompter Editor is signaled with a red dot ). Notice the current document progress indicator (not to be confused with the global progress indicator)",
    "slug": "docs/oto-basics/editing#rundown-panel-number-n-3"
  },
  {
    "title": "Markers",
    "content": "For a full understanding of OtO's powerful marker system, make sure to read the main chapter and its sub-sections. However, here's a quick guide to get you started: The Markers sub-panel keeps track of markers (which function like bookmarks). You can toggle the visibility of this sub-panel by clicking the button. To create a marker, select a short piece of text (1 to 3 words) in either the mini-editor or the Prompter Editor Panel and click the toolbar button (or CTRL+M or ⌘+M on mac). If you create a marker on text that already has one, doing this again will remove the existing marker. To jump (scroll) to a marker, click the button next to the marker in the Markers sub-panel . This will scroll either the mini-editor or the Prompter Editor Panel to that marker, depending on which one was last active (the one you were actually using). To delete a marker, double-click the icon (this is designed to prevent accidental deletions), or right-click on it and select \"Remove Marker\" type=info Markers are a key feature of OtO, and we strongly recommend reading the dedicated chapters to fully leverage their potential.",
    "slug": "docs/oto-basics/editing#markers-number-n-5"
  },
  {
    "title": "Setting Margins and Offsets",
    "content": "Clicking on the icon in the toolbar opens the margins dropdown which allows you to adjust the following settings across all documents within the current OtO project: Left and right margins (useful for adapting to screens or monitors that don’t display 100% of the image), specified in pixels. Line height as a percentage, to control line spacing. Vertical offset of Action Markers, specified in pixels.<br> This last parameter enables you to trigger Action Markers slightly earlier (negative values) or slightly later (positive values) based on the number of pixels you enter. Important: These values are saved within each specific OtO project, meaning they will not carry over to other projects, unlike a general Setting. However, you can set default values for these adjustments by going to:<br> ⚙ Settings → General → Default safe text margins for left and right margins. ⚙ Settings → General → Default Font Settings for line height. ⚙ Settings → Markers and Timers → Action Marker Vertical Offset in Pixels for the default marker offset. type=\"warning\" The ⚙ Settings → Markers and Timers → Action Marker Vertical Offset in Pixels setting for default marker offset should not be confused with the Scroll Offset ▶ cue indicator setting, which controls the offset (in pixels) when navigating between markers",
    "slug": "docs/oto-basics/editing#setting-margins-and-offsets"
  },
  {
    "title": "Languages and Scripts",
    "content": "Alphabets: <br> We’ve carefully selected several typefaces with various styles to cover all teleprompter readability needs across different languages and scripts. IBM Plex and its variants support over a hundred languages and more than seven alphabets, including Arabic, Cyrillic, Devanagari, Greek, Hebrew, Japanese, Korean, and Thai. Roboto covers Latin, Cyrillic, and Greek alphabets. Additionally, we’ve incorporated Noto SC for Simplified Chinese and Noto HK for Hong Kong Chinese. Script Directions: <br> Script directionality is mostly automated. When you import a .docX document, notes from a PowerPoint, or even paste text, OtO will automatically detect whether the script is \"Left-to-Right\" or \"Right-to-Left.\" However, you can manually set the script’s language by right-clicking on the script line in the Rundown Panel or clicking ... at the end of the line and selecting Languages, as shown below.",
    "slug": "docs/oto-basics/editing#languages-and-scripts"
  },
  {
    "title": "Rundown Panel",
    "content": "Rundown Panel The Rundown panel displays a list of all open documents and offers a variety of features for each document individually or for all documents collectively. It serves as a sort of toolbar for document management. ## Rundown Panel overview - You can select multiple documents using the panel checkboxes The topmost checkbox selects all documents. - The ... dots at the end of each document line open the document tools, a collection of helping features on a per-document basis - As for the TOP ... dots, they open the global document tools menu that allows you either to trigger actions for all selected documents or actions not related to any specific document (like AI powered text corrections, global .docX export etc.) - The status button becomes red when the document is active (meaning, the actual currently scrolling document on the prompter screen) - You will find two progress indicators: one for the active document and another one for the overall progress (corresponding to the entire rundown), located above the search field. - Under the duration column title, you'll find a small \"widget\" which displays duration related metadata. Click on the little clock icon, the widget will now display the wordcount of the document, and the cumulative wordcount if several documents are opened. Click again to get the cumulative time. - The button at the end of the line will directly scroll the Prompter Editor Panel to the beginning of the document - You can reorder the documents by drag and dropping them (click and hold any empty zone around the document title, you will see the mouse cursor become a hand, now drag the line before or between another document) - Finally, at the very bottom of the rundown panel , you’ll find, from left to right, the total number of documents in the rundown, the project title, and the current timing displayed alongside the total timing. ## Document Tools The document tools menu, accessible by clicking on the three dots ... at the end of each document's row (or with a right click on the row), offers a variety of useful options. While most are self-explanatory, here are some detailed explanations for a few of them: - Insert Line Breaks: Adds line breaks after most punctuation marks to improve readability, especially with larger font sizes. type=tip While the Insert Line Breaks algorithm works well in most cases, it's important to proofread the text afterward. Some punctuation may be misinterpreted, causing unwanted line breaks. - Split at Cursor: Splits the text at the cursor position, creating a new document from the second half. - Merge: First select two or more documents, and they will be merged into one - Allow Hyphens: Activates dynamic hyphenation without altering the actual text. The hyphenation reflects the document's language, which can be manually adjusted if incorrectly detected. You can turn off this feature at any time without needing to reformat the text. - Enhance Text Balance: Activates the \"Balanced Text\" mode, which prevents widows and orphans (e.g., single short words on a line), restructuring the overall text for improved readability. Like hyphenation, this feature doesn't alter the actual text and can be toggled off without reformatting. - Document Language: Allows you to manually change the document's language to optimize hyphenation and improve AI-powered features (see below). type=warning Network Mode & Text Formatting Features Please note that when Network Mode is active, the options Enhance Text Balance and Allow Hyphens will be disabled. This is because the rendering of these features heavily depends on the display settings of each individual computer, which could cause inconsistencies across devices. ## Global Document Tools The global document tools (accessible via the three dots ... at the top of the Rundown panel) allow you to perform actions across the entire document set: - Insert New: Inserts a new document at the top of the list. - Delete: Removes all selected documents. - Language Detection: If the language is not correctly detected, you can manually select the language at the bottom of the same dropdown menu (see below). - Convert to docX: Converts all selected documents into a single Word file. - OtO AI: Opens a submenu to apply a generative AI model to the currently selected text (the AI applies to a portion of selected text within either editor or ). - This submenu includes \"preset prompts\" optimized for teleprompting / cue-based talks. There is also a custom prompt where you can enter any transformation that will apply to the selected text. ## OtO AI Configuration In the ⚙ Settings panel under the \"General\" section, you can modify the type of AI model you want to use. - Local Model: If you want to use a local model, first select \"Local model\" under the \"AI provider\" option. Then, in the line below, browse for a compatible .gguf file. You can find an up-to-date list of such models here. - Remote Model: To use a remote model, you can choose between OpenAI (OtO will use the Chat-GPT Turbo 3.5 model by default, but you can choose any available model in the remote AI model field) or MistralAI (\"Mistral-small-latest\" model by default). - You will need an active API subscription to either Mistral or OpenAI to access remote models. Simply enter your API key in the required field. ## OtO Local AI configuration OtO can integrate artificial intelligence models, such as those provided by OpenAI or Mistral, if you have an API key. Aware of the sensitive nature of many documents used in a professional tool like OtO, we also offer the option to use an offline model, which you can download yourself. You can use any model that follows the GGUF specification. However, we recommend using smaller models quantized to 4-bits for optimal performance, as larger AI models may negatively impact your machine's performance. Regardless, to run even a 4-bit model, your machine must meet at least the following specifications: To run a 4-bit quantized version of a 7-billion parameter model like Mistral on a PC or Mac, the minimum recommended specifications will primarily depend on your use case, including inference speed, memory management, and hardware optimization (GPU vs. CPU). Below is a detailed breakdown of the minimum requirements for efficient performance: Here are the minimum recommended specifications for running a 4-bit quantized 7B model like Mistral - For PC: - CPU: Recent x86-64 processor (Intel/AMD) - RAM: 16GB - GPU (optional for faster performance): NVIDIA GPU with CUDA support (e.g., GTX 1650 or better) - Storage: SSD (for faster model loading) - For Mac: - CPU: Apple Silicon (M1/M2) or Intel Mac - RAM: 8GB (16gb recommended) Using a GPU is optional but can significantly speed up inference, especially for larger prompts. These specs will offer a faster and smoother experience when running inference on quantized models.",
    "slug": "docs/oto-basics/rundown"
  },
  {
    "title": "Rundown Panel overview",
    "content": "You can select multiple documents using the panel checkboxes The topmost checkbox selects all documents. The ... dots at the end of each document line open the document tools, a collection of helping features on a per-document basis As for the TOP ... dots, they open the global document tools menu that allows you either to trigger actions for all selected documents or actions not related to any specific document (like AI powered text corrections, global .docX export etc.) The status button becomes red when the document is active (meaning, the actual currently scrolling document on the prompter screen) You will find two progress indicators: one for the active document and another one for the overall progress (corresponding to the entire rundown), located above the search field. Under the duration column title, you'll find a small \"widget\" which displays duration related metadata. Click on the little clock icon, the widget will now display the wordcount of the document, and the cumulative wordcount if several documents are opened. Click again to get the cumulative time. The button at the end of the line will directly scroll the Prompter Editor Panel to the beginning of the document You can reorder the documents by drag and dropping them (click and hold any empty zone around the document title, you will see the mouse cursor become a hand, now drag the line before or between another document) Finally, at the very bottom of the rundown panel , you’ll find, from left to right, the total number of documents in the rundown, the project title, and the current timing displayed alongside the total timing.",
    "slug": "docs/oto-basics/rundown#rundown-panel-overview"
  },
  {
    "title": "Document Tools",
    "content": "The document tools menu, accessible by clicking on the three dots ... at the end of each document's row (or with a right click on the row), offers a variety of useful options. While most are self-explanatory, here are some detailed explanations for a few of them: Insert Line Breaks: Adds line breaks after most punctuation marks to improve readability, especially with larger font sizes. type=tip While the Insert Line Breaks algorithm works well in most cases, it's important to proofread the text afterward. Some punctuation may be misinterpreted, causing unwanted line breaks. Split at Cursor: Splits the text at the cursor position, creating a new document from the second half. Merge: First select two or more documents, and they will be merged into one Allow Hyphens: Activates dynamic hyphenation without altering the actual text. The hyphenation reflects the document's language, which can be manually adjusted if incorrectly detected. You can turn off this feature at any time without needing to reformat the text. Enhance Text Balance: Activates the \"Balanced Text\" mode, which prevents widows and orphans (e.g., single short words on a line), restructuring the overall text for improved readability. Like hyphenation, this feature doesn't alter the actual text and can be toggled off without reformatting. Document Language: Allows you to manually change the document's language to optimize hyphenation and improve AI-powered features (see below). type=warning Network Mode & Text Formatting Features Please note that when Network Mode is active, the options Enhance Text Balance and Allow Hyphens will be disabled. This is because the rendering of these features heavily depends on the display settings of each individual computer, which could cause inconsistencies across devices.",
    "slug": "docs/oto-basics/rundown#document-tools"
  },
  {
    "title": "Global Document Tools",
    "content": "The global document tools (accessible via the three dots ... at the top of the Rundown panel) allow you to perform actions across the entire document set: Insert New: Inserts a new document at the top of the list. Delete: Removes all selected documents. Language Detection: If the language is not correctly detected, you can manually select the language at the bottom of the same dropdown menu (see below). Convert to docX: Converts all selected documents into a single Word file. OtO AI: Opens a submenu to apply a generative AI model to the currently selected text (the AI applies to a portion of selected text within either editor or ). This submenu includes \"preset prompts\" optimized for teleprompting / cue-based talks. There is also a custom prompt where you can enter any transformation that will apply to the selected text.",
    "slug": "docs/oto-basics/rundown#global-document-tools"
  },
  {
    "title": "OtO AI Configuration",
    "content": "In the ⚙ Settings panel under the \"General\" section, you can modify the type of AI model you want to use. Local Model: If you want to use a local model, first select \"Local model\" under the \"AI provider\" option. Then, in the line below, browse for a compatible .gguf file. You can find an up-to-date list of such models here. Remote Model: To use a remote model, you can choose between OpenAI (OtO will use the Chat-GPT Turbo 3.5 model by default, but you can choose any available model in the remote AI model field) or MistralAI (\"Mistral-small-latest\" model by default). You will need an active API subscription to either Mistral or OpenAI to access remote models. Simply enter your API key in the required field.",
    "slug": "docs/oto-basics/rundown#oto-ai-configuration"
  },
  {
    "title": "OtO Local AI configuration",
    "content": "OtO can integrate artificial intelligence models, such as those provided by OpenAI or Mistral, if you have an API key. Aware of the sensitive nature of many documents used in a professional tool like OtO, we also offer the option to use an offline model, which you can download yourself. You can use any model that follows the GGUF specification. However, we recommend using smaller models quantized to 4-bits for optimal performance, as larger AI models may negatively impact your machine's performance. Regardless, to run even a 4-bit model, your machine must meet at least the following specifications: To run a 4-bit quantized version of a 7-billion parameter model like Mistral on a PC or Mac, the minimum recommended specifications will primarily depend on your use case, including inference speed, memory management, and hardware optimization (GPU vs. CPU). Below is a detailed breakdown of the minimum requirements for efficient performance: Here are the minimum recommended specifications for running a 4-bit quantized 7B model like Mistral For PC: CPU: Recent x86-64 processor (Intel/AMD) RAM: 16GB GPU (optional for faster performance): NVIDIA GPU with CUDA support (e.g., GTX 1650 or better) Storage: SSD (for faster model loading) For Mac: CPU: Apple Silicon (M1/M2) or Intel Mac RAM: 8GB (16gb recommended) Using a GPU is optional but can significantly speed up inference, especially for larger prompts. These specs will offer a faster and smoother experience when running inference on quantized models.",
    "slug": "docs/oto-basics/rundown#oto-local-ai-configuration"
  },
  {
    "title": "Prompting",
    "content": "Prompting Switching to prompter mode allows you to scroll the text at the speaker's pace, using either OtO's built-in tools or dedicated external devices. ## Prompting Mode - Click the button to display the prompter window. With an actual secondary monitor attached (or any kind of display matrix switch), the window will automatically be set to fullscreen (in a conventional camera teleprompting setup for instance, this would be the screen behind or above the glass).<br><br> With no additional screen plugged, the prompter window will be displayed as a floating window on the primary screen. You could set this window to fullscreen mode, and set up, for instance, a remote multi-screen display system (see the network section) type=tip To toggle between fullscreen mode / floating window mode, go to the Options Menu then click Toggle display fullscreen - By clicking the button (or with the shortchut CTRL+P or ⌘+P on mac), you will switch to prompter mode, the toolbar will change its appearance, and you will no longer be able to edit the text from the Prompter Editor Panel , you can still do so from the mini-editor though. Now, your task is to scroll the text at the speaker's pace! - Notice the black section at the top of the Prompter Editor Panel . That's the \"Prompter Safe View\" sub-panel part of the text that the speaker actually sees on the prompter screen. Everything below it allows you to anticipate the upcoming text, but the speaker will not see it. type=tip If you are new to using a teleprompter, read the section dedicated to tips for the operator. Although these tips are primarily aimed at operators scrolling text for a speaker, most of them are also suitable for solo presentations. ## Mirroring & Rotation OtO allows you to mirror and rotate your text (on the external display) to accommodate different types of teleprompter setups, such as camera-mounted teleprompters, presidential / stage prompters You can adjust these settings directly either from the toolbar or from the menu options: - From the toolbar: Click button to mirror the image and / or button to rotate the image upside / down - From the menu: Click on Options then Activate Mirror Mode(ext. display) to mirror the image, and, still in Options, Rotate external display to rotate the image 180° These settings ensure that your text remains clear and readable in any professional setup, whether for broadcast, live events, or public speaking engagements. ## Prompting Speed - To adjust the scrolling / prompting speed, you can drag the blue slider next to the button. You will scroll backwards if you drag it below Zero and upwards otherwise. - You can also click on the Prompter Editor panel to get it focused and press multiple times UP↑ (faster) and DOWN↓ arrows (slower) of your keyboard - But don't stop there, OtO is designed to be used with multiple physical controllers. If you're the lucky owner of a Contour™ Shuttle Xpress or Shuttle Pro, you can configure it by going to Controllers Settings Panel (via Options menu then Controller Speed or ⚙ Settings → Controllers) - To exit prompting Mode and go back to editing mode, just click again on the or use the keyboard shortcut CTRL+P or ⌘+P on mac) - Clicking on in the toolbar will allow you to change the left and right margins of the documents inside the current OtO projects (to adapt to any safe margins of the extenral display for instance) as well as the global line height. It's an important feature detailed in the editing section. ## Configuring a Scrolling Device OtO enables text scrolling using your keyboard, a Contour™ Shuttle Xpress or Shuttle Pro (recommended), or any compatible MIDI device like control surfaces or the worth-discovering nOb and the dark fader, or any MIDI compliant mobile app like TouchDaw. To configure these devices, go to the settings panel (⚙ Settings → Controllers) or click on . Within the three tabs—\"Keyboard\", \"Shuttle\", and \"Midi\"—you can adjust key/button assignments for each device. Make sure your device is properly connected to your computer. Then, select it from the \"Shuttle Controllers\" or \"Midi Controllers\" dropdown menu. If necessary, choose the appropriate port. To assign a command to a button or control, click the Change button, activate the desired control or button, and be sure to save your settings once you're done. Some Considerations on Scrolling Speed for Different Devices: - For Contour Shuttle devices, only the buttons are assignable; the wheel is hardcoded to control the scrolling speed. - For the keyboard, scrolling speed is controlled with two keys: one set to \"faster\" and the other to \"slower.\" The more times you press either key, the faster (or slower) the scrolling becomes. - For MIDI devices, you'll likely want to assign the \"speed\" command to a CC controller or PitchBend. The \"faster\" and \"slower\" commands for MIDI are relatively less useful since they work with buttons, similar to the keyboard setup. It's generally better to use the \"speed\" setting. type=info A common configuration involves assigning a CC controller to \"speed\" and a button to \"reverse,\" allowing you to control scrolling with just one control and change direction with a single button. Other devices like the Contour™ Shuttle Xpress or Shuttle Pro, or the PitchBend input of many MIDI devices are bipolar, meaning you can scroll the prompting window up or down with the same controller without involving a \"reverse\" button. ## Adjusting Speed Settings You can fine-tune the acceleration curve of your controller by going to ⚙ Settings → Speed. This allows you to, for example, have more precision at slower speeds (and less at higher speeds). By default, four pre-configured speed settings are provided, which cover most common needs. You can view and take inspiration from these preset curves to create your own by clicking the button. To delete a custom curve, click the button (note that factory presets cannot be deleted). You can also globally adjust or \"amplify\" the overall speed by sliding the control under Global Speed Amplifier. ## Prompting Tips Teleprompting may seem simple, but mastering the flow and timing is key to ensuring a smooth presentation. Here are some practical tips to help new operators: Adapt - The most important tip for teleprompting is the operator must always adapt to the speaker's pace, not the other way around. It's the operator's responsibility to ensure the text scrolls at a comfortable speed for the speaker, maintaining a smooth flow. Communication - For speakers using a teleprompter for the first time, it’s crucial to communicate this upfront. Let them know that they are in control—they don’t need to rush or follow the scrolling; the operator will adjust to their natural speaking rhythm. This helps put them and the team at ease and improves the overall experience. Know the Script Inside Out - Familiarize yourself with the content before the session begins. Understanding the tone, pacing, and structure of the script will help you anticipate when the speaker may need to pause, slow down, or speed up Maintain Eye Contact with the Speaker - As the operator, you need to monitor the speaker. Watch their facial expressions, gestures, and breathing to gauge their pace. This allows you to adjust the scrolling speed in real-time. Start Slowly - In the beginning, it's better to scroll slower than you think is necessary. Speakers tend to start cautiously and build up their pace. Starting slow helps them settle in without feeling rushed. Use Shortcuts & Controllers Efficiently - Get comfortable with OtO’s keyboard shortcuts or external controllers (like Shuttle Xpress) to adjust speed or navigate between sections. These shortcuts will save time and help you manage the flow without disrupting your focus. Adjust Prompting Speed Gradually - Avoid making sudden speed adjustments. If the speaker accelerates, smoothly increase the scrolling speed. A sudden change can confuse the speaker and break their concentration. Practice Syncing with the Speaker - Every speaker has a unique rhythm. Whether they read fast or slow, practice staying in sync with them, especially during rehearsals. This practice ensures smoother coordination during live events. Prepare for Unexpected Changes - Speakers often improvise or skip sections. Stay calm and quickly jump to the appropriate section using markers or scroll manually. OtO's action markers and keyboard shortcuts can help you do this efficiently. Stay Focused Throughout - Teleprompting requires constant attention. Avoid distractions during the presentation at all cost, as losing focus for just a few seconds could throw off the speaker's flow. By following these tips and practicing regularly, you’ll quickly become confident in operating the teleprompter smoothly and effectively!",
    "slug": "docs/oto-basics/prompting"
  },
  {
    "title": "Prompting Mode",
    "content": "Click the button to display the prompter window. With an actual secondary monitor attached (or any kind of display matrix switch), the window will automatically be set to fullscreen (in a conventional camera teleprompting setup for instance, this would be the screen behind or above the glass).<br><br> With no additional screen plugged, the prompter window will be displayed as a floating window on the primary screen. You could set this window to fullscreen mode, and set up, for instance, a remote multi-screen display system (see the network section) type=tip To toggle between fullscreen mode / floating window mode, go to the Options Menu then click Toggle display fullscreen By clicking the button (or with the shortchut CTRL+P or ⌘+P on mac), you will switch to prompter mode, the toolbar will change its appearance, and you will no longer be able to edit the text from the Prompter Editor Panel , you can still do so from the mini-editor though. Now, your task is to scroll the text at the speaker's pace! Notice the black section at the top of the Prompter Editor Panel . That's the \"Prompter Safe View\" sub-panel part of the text that the speaker actually sees on the prompter screen. Everything below it allows you to anticipate the upcoming text, but the speaker will not see it. type=tip If you are new to using a teleprompter, read the section dedicated to tips for the operator. Although these tips are primarily aimed at operators scrolling text for a speaker, most of them are also suitable for solo presentations.",
    "slug": "docs/oto-basics/prompting#prompting-mode"
  },
  {
    "title": "**Mirroring & Rotation**",
    "content": "OtO allows you to mirror and rotate your text (on the external display) to accommodate different types of teleprompter setups, such as camera-mounted teleprompters, presidential / stage prompters You can adjust these settings directly either from the toolbar or from the menu options: From the toolbar: Click button to mirror the image and / or button to rotate the image upside / down From the menu: Click on Options then Activate Mirror Mode(ext. display) to mirror the image, and, still in Options, Rotate external display to rotate the image 180° These settings ensure that your text remains clear and readable in any professional setup, whether for broadcast, live events, or public speaking engagements.",
    "slug": "docs/oto-basics/prompting#mirroring-rotation"
  },
  {
    "title": "Prompting Speed",
    "content": "To adjust the scrolling / prompting speed, you can drag the blue slider next to the button. You will scroll backwards if you drag it below Zero and upwards otherwise. You can also click on the Prompter Editor panel to get it focused and press multiple times UP↑ (faster) and DOWN↓ arrows (slower) of your keyboard But don't stop there, OtO is designed to be used with multiple physical controllers. If you're the lucky owner of a Contour™ Shuttle Xpress or Shuttle Pro, you can configure it by going to Controllers Settings Panel (via Options menu then Controller Speed or ⚙ Settings → Controllers) To exit prompting Mode and go back to editing mode, just click again on the or use the keyboard shortcut CTRL+P or ⌘+P on mac) Clicking on in the toolbar will allow you to change the left and right margins of the documents inside the current OtO projects (to adapt to any safe margins of the extenral display for instance) as well as the global line height. It's an important feature detailed in the editing section.",
    "slug": "docs/oto-basics/prompting#prompting-speed"
  },
  {
    "title": "Configuring a Scrolling Device",
    "content": "OtO enables text scrolling using your keyboard, a Contour™ Shuttle Xpress or Shuttle Pro (recommended), or any compatible MIDI device like control surfaces or the worth-discovering nOb and the dark fader, or any MIDI compliant mobile app like TouchDaw. To configure these devices, go to the settings panel (⚙ Settings → Controllers) or click on . Within the three tabs—\"Keyboard\", \"Shuttle\", and \"Midi\"—you can adjust key/button assignments for each device. Make sure your device is properly connected to your computer. Then, select it from the \"Shuttle Controllers\" or \"Midi Controllers\" dropdown menu. If necessary, choose the appropriate port. To assign a command to a button or control, click the Change button, activate the desired control or button, and be sure to save your settings once you're done. Some Considerations on Scrolling Speed for Different Devices: For Contour Shuttle devices, only the buttons are assignable; the wheel is hardcoded to control the scrolling speed. For the keyboard, scrolling speed is controlled with two keys: one set to \"faster\" and the other to \"slower.\" The more times you press either key, the faster (or slower) the scrolling becomes. For MIDI devices, you'll likely want to assign the \"speed\" command to a CC controller or PitchBend. The \"faster\" and \"slower\" commands for MIDI are relatively less useful since they work with buttons, similar to the keyboard setup. It's generally better to use the \"speed\" setting. type=info A common configuration involves assigning a CC controller to \"speed\" and a button to \"reverse,\" allowing you to control scrolling with just one control and change direction with a single button. Other devices like the Contour™ Shuttle Xpress or Shuttle Pro, or the PitchBend input of many MIDI devices are bipolar, meaning you can scroll the prompting window up or down with the same controller without involving a \"reverse\" button.",
    "slug": "docs/oto-basics/prompting#configuring-a-scrolling-device"
  },
  {
    "title": "Adjusting Speed Settings",
    "content": "You can fine-tune the acceleration curve of your controller by going to ⚙ Settings → Speed. This allows you to, for example, have more precision at slower speeds (and less at higher speeds). By default, four pre-configured speed settings are provided, which cover most common needs. You can view and take inspiration from these preset curves to create your own by clicking the button. To delete a custom curve, click the button (note that factory presets cannot be deleted). You can also globally adjust or \"amplify\" the overall speed by sliding the control under Global Speed Amplifier.",
    "slug": "docs/oto-basics/prompting#adjusting-speed-settings"
  },
  {
    "title": "Prompting Tips",
    "content": "Teleprompting may seem simple, but mastering the flow and timing is key to ensuring a smooth presentation. Here are some practical tips to help new operators: Adapt The most important tip for teleprompting is the operator must always adapt to the speaker's pace, not the other way around. It's the operator's responsibility to ensure the text scrolls at a comfortable speed for the speaker, maintaining a smooth flow. Communication For speakers using a teleprompter for the first time, it’s crucial to communicate this upfront. Let them know that they are in control—they don’t need to rush or follow the scrolling; the operator will adjust to their natural speaking rhythm. This helps put them and the team at ease and improves the overall experience. Know the Script Inside Out Familiarize yourself with the content before the session begins. Understanding the tone, pacing, and structure of the script will help you anticipate when the speaker may need to pause, slow down, or speed up Maintain Eye Contact with the Speaker As the operator, you need to monitor the speaker. Watch their facial expressions, gestures, and breathing to gauge their pace. This allows you to adjust the scrolling speed in real-time. Start Slowly In the beginning, it's better to scroll slower than you think is necessary. Speakers tend to start cautiously and build up their pace. Starting slow helps them settle in without feeling rushed. Use Shortcuts & Controllers Efficiently Get comfortable with OtO’s keyboard shortcuts or external controllers (like Shuttle Xpress) to adjust speed or navigate between sections. These shortcuts will save time and help you manage the flow without disrupting your focus. Adjust Prompting Speed Gradually Avoid making sudden speed adjustments. If the speaker accelerates, smoothly increase the scrolling speed. A sudden change can confuse the speaker and break their concentration. Practice Syncing with the Speaker Every speaker has a unique rhythm. Whether they read fast or slow, practice staying in sync with them, especially during rehearsals. This practice ensures smoother coordination during live events. Prepare for Unexpected Changes Speakers often improvise or skip sections. Stay calm and quickly jump to the appropriate section using markers or scroll manually. OtO's action markers and keyboard shortcuts can help you do this efficiently. Stay Focused Throughout Teleprompting requires constant attention. Avoid distractions during the presentation at all cost, as losing focus for just a few seconds could throw off the speaker's flow. By following these tips and practicing regularly, you’ll quickly become confident in operating the teleprompter smoothly and effectively!",
    "slug": "docs/oto-basics/prompting#prompting-tips"
  },
  {
    "title": "Controllers in OtO",
    "content": "Controllers in OtO Controllers are a key part of OtO's functionality, allowing for smooth, efficient, and precise control of the teleprompter. While OtO can be operated with just a keyboard and mouse, using dedicated hardware controllers significantly enhances the prompting experience for both the operator and speaker. ## Controller Types OtO supports several types of controllers: 1. Keyboard - Basic control using keyboard shortcuts 2. Contour Shuttle Devices - Dedicated video editing controllers (Shuttle Xpress, Shuttle Pro) 3. MIDI Controllers - Any MIDI-compliant device including specialized controllers like nOb and Dark Fader 4. Control Surfaces - Devices like the Loupedeck that can be configured to work with OtO ## Configuring Controllers To configure any controller in OtO, navigate to: - ⚙ Settings → Controllers in the main menu - Or click the controller icon in the toolbar The settings panel has three tabs for configuring different controller types: - Keyboard - For keyboard shortcuts - Shuttle - For Contour Shuttle Xpress or Shuttle Pro devices - MIDI - For any MIDI-compatible controller ### Keyboard Configuration The keyboard tab allows you to assign various OtO commands to specific key combinations. This is particularly useful for: - Setting up speed control keys (faster/slower) - Creating keyboard shortcuts for essential functions - Configuring marker navigation shortcuts To assign a keyboard shortcut: 1. Click the Change button next to the command you want to assign 2. Press the key combination you wish to use 3. Click Save when you've completed your configuration ### Shuttle Device Configuration Contour Design's Shuttle controllers (Shuttle Xpress and Shuttle Pro) are highly recommended for professional teleprompter operation. These devices feature a jog wheel for precise control and multiple programmable buttons. To configure a Shuttle device: 1. Connect your Shuttle device to your computer 2. In OtO's controller settings, select your device from the \"Shuttle Controllers\" dropdown 3. For each button, click Change and press the button on your controller you want to assign 4. Click Save when finished Note: The jog/shuttle wheel functionality is automatically mapped to control scrolling speed and is not customizable. ### MIDI Controller Configuration MIDI controllers offer the most flexibility and precision for controlling OtO. Any MIDI-compliant device can be configured, including: 1. Standard MIDI Controllers - Devices with faders, knobs, and buttons like the nOb controller or the Dark Fader is a sleek, minimalist MIDI controller featuring a high-quality 100mm fader that provides excellent precision for teleprompter control 2. Specialized Controllers - Such as the nOb and Dark Fader 3. Mobile Apps - MIDI control apps like TouchDaw 4. DAW Controllers - Music production controllers that output MIDI To configure a MIDI controller: 1. Connect your MIDI device to your computer 2. In OtO's controller settings, select your device from the \"MIDI Controllers\" dropdown 3. Select the appropriate MIDI port if multiple options are available 4. For each command, click Change and move/press the control on your MIDI device you want to assign 5. Click Save when finished #### Speed Control Considerations for MIDI When configuring MIDI controllers for speed control, you have several options: - Speed Command: Assign a continuous controller (CC) or PitchBend to directly control the scrolling speed. This is the most intuitive option for most users. - Faster/Slower Commands: Similar to keyboard controls, these increment or decrement the speed with each press. - Reverse Command: Assign a button to reverse the scrolling direction. For the best experience with analog controllers (knobs, faders, etc.), we recommend: - Assigning \"Speed\" to a continuous controller - Using a bipolar controller (one that returns to center position) if available - Alternatively, setting up \"Reverse\" on a separate button if using a unidirectional fader type=info You cannot assign a key or button to a command that is already assigned. To resolve this, press the 'delete' button to free up the key or button, and then try again. ## Loupedeck The Loupedeck CT controller is the currently recommended way to control OtO. It can be configured to work with OtO through their custom software. This highly versatile controller offer a very convenient and smooth knob for precise scrolls, buttons, and touch controls for comprehensive OtO operation. For Loupedeck configuration: 1. Install the Loupedeck software and load the custom profiles for OtO (available on oto.software website). 2. Make sure the keyboard controler is enabled in the settings, and the reset the key bindings to factory settings if you changed them ## Speed Setting Configuration Beyond assigning controls, you can fine-tune how controllers affect OtO's scrolling behavior by adjusting the speed settings: 1. Navigate to ⚙ Settings → Speed 2. Select a preset acceleration curve or create your own 3. Adjust the \"Global Speed Amplifier\" to increase or decrease overall sensitivity The acceleration curves determine how controller input translates to scrolling speed: - Linear - Direct 1:1 mapping between input and speed - Exponential - More precision at slower speeds, faster acceleration at higher inputs - Logarithmic - Gentler initial response for fine control - Custom - Create your own curve using the graphical editor ## Best Practices for Controller Setup For professional teleprompting, we recommend: 1. Use dedicated hardware - While keyboards work, dedicated controllers provide better precision and feel 2. Match the controller to your workflow - Choose a controller that suits your specific needs: - Shuttle devices for general-purpose control - nOb or Dark Fader for precision speed control - Loupedeck or MIDI control surfaces for comprehensive control 3. Practice with your controller - Become familiar with your controller before using it in production 4. Create custom acceleration curves - Tailor the response to your preference and the specific controller 5. Set up alternative control methods - Always have a backup control method configured With proper controller setup, OtO becomes an even more powerful tool for professional teleprompting, allowing operators to focus on the speaker rather than the interface.",
    "slug": "docs/oto-basics/controllers"
  },
  {
    "title": "Controller Types",
    "content": "OtO supports several types of controllers: Keyboard - Basic control using keyboard shortcuts Contour Shuttle Devices - Dedicated video editing controllers (Shuttle Xpress, Shuttle Pro) MIDI Controllers - Any MIDI-compliant device including specialized controllers like nOb and Dark Fader Control Surfaces - Devices like the Loupedeck that can be configured to work with OtO",
    "slug": "docs/oto-basics/controllers#controller-types"
  },
  {
    "title": "Configuring Controllers",
    "content": "To configure any controller in OtO, navigate to: ⚙ Settings → Controllers in the main menu Or click the controller icon in the toolbar The settings panel has three tabs for configuring different controller types: Keyboard - For keyboard shortcuts Shuttle - For Contour Shuttle Xpress or Shuttle Pro devices MIDI - For any MIDI-compatible controller Keyboard Configuration The keyboard tab allows you to assign various OtO commands to specific key combinations. This is particularly useful for: Setting up speed control keys (faster/slower) Creating keyboard shortcuts for essential functions Configuring marker navigation shortcuts To assign a keyboard shortcut: Click the Change button next to the command you want to assign Press the key combination you wish to use Click Save when you've completed your configuration Shuttle Device Configuration Contour Design's Shuttle controllers (Shuttle Xpress and Shuttle Pro) are highly recommended for professional teleprompter operation. These devices feature a jog wheel for precise control and multiple programmable buttons. To configure a Shuttle device: Connect your Shuttle device to your computer In OtO's controller settings, select your device from the \"Shuttle Controllers\" dropdown For each button, click Change and press the button on your controller you want to assign Click Save when finished Note: The jog/shuttle wheel functionality is automatically mapped to control scrolling speed and is not customizable. MIDI Controller Configuration MIDI controllers offer the most flexibility and precision for controlling OtO. Any MIDI-compliant device can be configured, including: Standard MIDI Controllers - Devices with faders, knobs, and buttons like the nOb controller or the Dark Fader is a sleek, minimalist MIDI controller featuring a high-quality 100mm fader that provides excellent precision for teleprompter control Specialized Controllers - Such as the nOb and Dark Fader Mobile Apps - MIDI control apps like TouchDaw DAW Controllers - Music production controllers that output MIDI To configure a MIDI controller: Connect your MIDI device to your computer In OtO's controller settings, select your device from the \"MIDI Controllers\" dropdown Select the appropriate MIDI port if multiple options are available For each command, click Change and move/press the control on your MIDI device you want to assign Click Save when finished Speed Control Considerations for MIDI When configuring MIDI controllers for speed control, you have several options: Speed Command: Assign a continuous controller (CC) or PitchBend to directly control the scrolling speed. This is the most intuitive option for most users. Faster/Slower Commands: Similar to keyboard controls, these increment or decrement the speed with each press. Reverse Command: Assign a button to reverse the scrolling direction. For the best experience with analog controllers (knobs, faders, etc.), we recommend: Assigning \"Speed\" to a continuous controller Using a bipolar controller (one that returns to center position) if available Alternatively, setting up \"Reverse\" on a separate button if using a unidirectional fader type=info You cannot assign a key or button to a command that is already assigned. To resolve this, press the 'delete' button to free up the key or button, and then try again.",
    "slug": "docs/oto-basics/controllers#configuring-controllers"
  },
  {
    "title": "Loupedeck",
    "content": "The Loupedeck CT controller is the currently recommended way to control OtO. It can be configured to work with OtO through their custom software. This highly versatile controller offer a very convenient and smooth knob for precise scrolls, buttons, and touch controls for comprehensive OtO operation. For Loupedeck configuration: Install the Loupedeck software and load the custom profiles for OtO (available on oto.software website). Make sure the keyboard controler is enabled in the settings, and the reset the key bindings to factory settings if you changed them",
    "slug": "docs/oto-basics/controllers#loupedeck"
  },
  {
    "title": "Speed Setting Configuration",
    "content": "Beyond assigning controls, you can fine-tune how controllers affect OtO's scrolling behavior by adjusting the speed settings: Navigate to ⚙ Settings → Speed Select a preset acceleration curve or create your own Adjust the \"Global Speed Amplifier\" to increase or decrease overall sensitivity The acceleration curves determine how controller input translates to scrolling speed: Linear - Direct 1:1 mapping between input and speed Exponential - More precision at slower speeds, faster acceleration at higher inputs Logarithmic - Gentler initial response for fine control Custom - Create your own curve using the graphical editor",
    "slug": "docs/oto-basics/controllers#speed-setting-configuration"
  },
  {
    "title": "Best Practices for Controller Setup",
    "content": "For professional teleprompting, we recommend: Use dedicated hardware - While keyboards work, dedicated controllers provide better precision and feel Match the controller to your workflow - Choose a controller that suits your specific needs: Shuttle devices for general-purpose control nOb or Dark Fader for precision speed control Loupedeck or MIDI control surfaces for comprehensive control Practice with your controller - Become familiar with your controller before using it in production Create custom acceleration curves - Tailor the response to your preference and the specific controller Set up alternative control methods - Always have a backup control method configured With proper controller setup, OtO becomes an even more powerful tool for professional teleprompting, allowing operators to focus on the speaker rather than the interface.",
    "slug": "docs/oto-basics/controllers#best-practices-for-controller-setup"
  },
  {
    "title": "Standard Markers",
    "content": "Standard Markers In OtO, markers are like small bookmarks that allow you to quickly navigate through all your documents. ## Creating a Marker To create a marker, you first need to select some text (usually a word, between 2 and 30 characters) in one of the two editors; then either click the create/delete marker button in the toolbar , or use the CTRL+M or CMD+M shortcut. The marker will appear as text surrounded by a border, accompanied by its \"description\" in a small box at the bottom left of the marker, like this: By default, this description will take the value of the marker text itself. The marker will then be listed in the marker panel, which displays a list of all the markers from all documents, in the order they appear in the texts. If you don't see the marker panel, make sure it is enabled by clicking the button . ## Renaming the Marker Description Let's say you want to turn the word \"hello\" in a text into a marker. By default, the description will also be \"hello,\" but if you want to remember why you placed a marker at this spot (to identify a scene shift, a speaker change, etc.), you can change the description content by clicking on the description label, as shown in the illustration below: The marker will then appear as follows: ## Selecting a marker To select a marker (to toggle it's type for instance), you may either double-click on its text content in one of the two editors / , or double-click on the target Icon next to the marker name in the marker list ## Changing the Marker Type There are three types of markers: Standard and presenter markers serve the same bookmarking purpose, just with different colors to help you see things more clearly. Additionally, presenter markers can be configured not to appear on the external prompter screen (to help you as the operator, without disrupting the speaker’s readability). As for ActionMarkers, they are a powerful OtO feature explained in more detail here. You can change the marker type (toggle between Standard / Presenter. Action Markers require a specfic syntax by first selecting it with a double-click in either editor, then clicking the button Finally, you can configure which marker types should appear on the prompter screen by going to ⚙ Settings -> Markers and timers then, select \"Show markers on external display\" ## Navigating Between Markers To jump directly to any marker, click the in the marker panel . type=warning - BE CAREFUL! In Prompting mode , only the the Prompting Editor will scroll to the desired marker - In Editing Mode however, A click on will scroll the editor area (either or ) will scroll to that marker. This allows you, to keeping the Prompter Editor display in place to avoid distracting the speaker. type=tip To find the same text across editors, select one or more words and click the button To move to the next or previous marker, you can either: - Click the buttons or - Use the shortcut on your physical controller (you can change the assignments in ⚙ Settings -> Controllers then bind the input for the \"Next\" and \"Previous\" markers) - The default keyboard shortcuts are CTRL+PAGEDOWN and CTRL+PAGEUP - Last but not least, when navigating between markers, you can choose either to scroll the text so that the marker lands at the bottom of the screen—giving you, for example, time to anticipate upcoming Action Markers—or to scroll the text so that the marker aligns precisely with the cue indicator ▶. If desired, you can add an offset of +/- 150 pixels to fine-tune this positioning. Go to ⚙ Settings → Markers and Timers → Scroll Offset ▶ cue indicator to enable or disable this behavior and set the aforementioned offset. type=\"warning\" - This Scroll Offset ▶ cue indicator which controls the offset (in pixels) when navigating between markers setting for should not be confused with ⚙ Settings → Markers and Timers → Action Marker Vertical Offset in Pixels, which sets the default offset for triggering Action Markers ## Deleting a Marker You can either double-click the button (we don't want you to accidentally delete a marker with a single click!) Or select the marker text in one of the two editors and click the button . Finally, deleting the text containing the marker will, of course, also delete the marker.\"",
    "slug": "docs/markers/standard-markers"
  },
  {
    "title": "Creating a Marker",
    "content": "To create a marker, you first need to select some text (usually a word, between 2 and 30 characters) in one of the two editors; then either click the create/delete marker button in the toolbar , or use the CTRL+M or CMD+M shortcut. The marker will appear as text surrounded by a border, accompanied by its \"description\" in a small box at the bottom left of the marker, like this: By default, this description will take the value of the marker text itself. The marker will then be listed in the marker panel, which displays a list of all the markers from all documents, in the order they appear in the texts. If you don't see the marker panel, make sure it is enabled by clicking the button .",
    "slug": "docs/markers/standard-markers#creating-a-marker"
  },
  {
    "title": "Renaming the Marker Description",
    "content": "Let's say you want to turn the word \"hello\" in a text into a marker. By default, the description will also be \"hello,\" but if you want to remember why you placed a marker at this spot (to identify a scene shift, a speaker change, etc.), you can change the description content by clicking on the description label, as shown in the illustration below: The marker will then appear as follows:",
    "slug": "docs/markers/standard-markers#renaming-the-marker-description"
  },
  {
    "title": "Selecting a marker",
    "content": "To select a marker (to toggle it's type for instance), you may either double-click on its text content in one of the two editors / , or double-click on the target Icon next to the marker name in the marker list",
    "slug": "docs/markers/standard-markers#selecting-a-marker"
  },
  {
    "title": "Changing the Marker Type",
    "content": "There are three types of markers: Standard and presenter markers serve the same bookmarking purpose, just with different colors to help you see things more clearly. Additionally, presenter markers can be configured not to appear on the external prompter screen (to help you as the operator, without disrupting the speaker’s readability). As for ActionMarkers, they are a powerful OtO feature explained in more detail here. You can change the marker type (toggle between Standard / Presenter. Action Markers require a specfic syntax by first selecting it with a double-click in either editor, then clicking the button Finally, you can configure which marker types should appear on the prompter screen by going to ⚙ Settings -> Markers and timers then, select \"Show markers on external display\"",
    "slug": "docs/markers/standard-markers#changing-the-marker-type"
  },
  {
    "title": "Navigating Between Markers",
    "content": "To jump directly to any marker, click the in the marker panel . type=warning BE CAREFUL! In Prompting mode , only the the Prompting Editor will scroll to the desired marker In Editing Mode however, A click on will scroll the editor area (either or ) will scroll to that marker. This allows you, to keeping the Prompter Editor display in place to avoid distracting the speaker. type=tip To find the same text across editors, select one or more words and click the button To move to the next or previous marker, you can either: Click the buttons or Use the shortcut on your physical controller (you can change the assignments in ⚙ Settings -> Controllers then bind the input for the \"Next\" and \"Previous\" markers) The default keyboard shortcuts are CTRL+PAGEDOWN and CTRL+PAGEUP Last but not least, when navigating between markers, you can choose either to scroll the text so that the marker lands at the bottom of the screen—giving you, for example, time to anticipate upcoming Action Markers—or to scroll the text so that the marker aligns precisely with the cue indicator ▶. If desired, you can add an offset of +/- 150 pixels to fine-tune this positioning. Go to ⚙ Settings → Markers and Timers → Scroll Offset ▶ cue indicator to enable or disable this behavior and set the aforementioned offset. type=\"warning\" This Scroll Offset ▶ cue indicator which controls the offset (in pixels) when navigating between markers setting for should not be confused with ⚙ Settings → Markers and Timers → Action Marker Vertical Offset in Pixels, which sets the default offset for triggering Action Markers",
    "slug": "docs/markers/standard-markers#navigating-between-markers"
  },
  {
    "title": "Deleting a Marker",
    "content": "You can either double-click the button (we don't want you to accidentally delete a marker with a single click!) Or select the marker text in one of the two editors and click the button . Finally, deleting the text containing the marker will, of course, also delete the marker.\"",
    "slug": "docs/markers/standard-markers#deleting-a-marker"
  },
  {
    "title": "Action Markers",
    "content": "Action Markers One of OtO’s missions is to restore the speaker’s role as the conductor. Thanks to Action Markers, OtO can orchestrate all events around the text, from advancing PowerPoint slides to playing jingles, launching videos, and controlling lights ## How do Action Markers work? ActionMarkers are just like other markers, except they trigger events (like passing slides, playing videos or sounds etc.) when the text scrolls and the marker passes in front of the ▶ cue indicator. ActionMarkers are first created as standard markers, meaning you need to select a portion of text and then either click the button or use the shortcut CTRL + M or ⌘ + M. Afterward, to \"convert\" them into Action Markers, you must use a specific syntax, as explained below. This syntax determines the type of action the marker will trigger, allowing you to control external events, such as slides, sounds, or videos, during your presentation. ActionMarkers are automatically triggered in prompter mode only, when the text scrolls and the marker passes in front of the ▶ cue indicator. This ensures that actions are executed precisely at the right moment during the presentation or performance, aligned with the speaker's pace. The trigger is signaled by a slight flash lasting about one second. type=tip You may still manually trigger action markers on certain conditions, see below to know how type=info MARKER OFFSET SHIFT The actionMarkers will be triggered as the text scrolls and the marker passes in front of the ▶ cue indicator. You can fine-tune the vertical offset (relative to the ▶ cue indicator position) in the margins dropdown. Click icon in the toolbar and enter a positive or negative value in the \"Action Marker vertical Offset in pixels\" ## Time to next ActionMarker When the Show timer option is enabled (Option Menu → then Show Timer), the remaining time before the next Action Marker will be displayed as a countdown and will adjust according to the scrolling speed. This allows you—and potentially your team—to anticipate the upcoming event. It can be a valuable tool for cue operators, speakers, and stage managers! You may also display (or hide) this countdown on the prompter window or external screen. To do so, go to ⚙ Settings -> Markers and Timers -> then Show markers on external display, and enable \"Show Time to Next Action Marker\". See the Overlay chapter to get more detailed informations. type=warning Be aware that the countdown to the next marker will only be displayed when it is less than 150 seconds away. ## Action Marker Features Action Markers can trigger several types of events, and we will continue to expand this list with future updates: 1. MIDI MIDI actions allow you to trigger MIDI events such as noteOn, noteOff, or a controller event (CC). This enables communication with a wide variety of devices for coordinating sound and lighting. Refer to the documentation of the equipment or software you wish to control to understand how it responds to these types of instructions. Some well-known sound and lighting equipment for large events that can be controlled via MIDI include: - Pioneer DJ Mixers and Controllers for automated sound effects and transitions - Martin Professional Lighting Controllers for synchronized lighting effects - Ableton Live for triggering audio and visual cues during live performances 2. PowerPoint You can easily control any PowerPoint presentation with OtO. Refer to the dedicated commands below as well as the PowerPoint setup guide for more details. 3. OSC Servers and HTTP Servers Beyond MIDI, you can communicate with audio or video systems that support the OSC (Open Sound Control) protocol or use a message translator like Osculator or atemOSC by BanyanAV to control Blackmagic™ Atem™ video switchers. Similarly, you can send any conceivable request via the HTTP protocol to control external devices. All of this is covered in the \"Network Markers\" section. 4. Timers It is possible to control the display of the OtO timer, set it to a specific time, pause it, or restart it as needed. ## Creating an Action Marker Creating an action marker differs slightly from standard markers and requires specific syntax. First you need to create a standard Marker, then you should enter a special description The syntax to enter as a description for creating an actionMarker can be defined as follows: /group:command(option) Here’s a breakdown of this structure: - / Every actionMarker starts with a slash. - group – Refers to the type of command, such as controlling slides, playing sounds, or triggering other events (see below for a list of compatible groups and commands) - command – Specifies the exact action to be executed within the group, such as advancing to a particular slide or starting a video. - (option) – Optional parameters between parenthesis that refine the command, such as slide numbers, sound files, or lighting settings. Example:<br> To trigger the midi note E2 with a velocity of 120 (assuming you've set up a working midi device), the command would be:<br> /midi:e2(120) In this case: - midi is the group. - e2 is the command to trigger the E2 note - (120) is the option, specifying the velocity level This flexible syntax allows OtO to manage a wide range of actions based on the needs of your presentation or performance. ## Default actions syntax Here is the list of command types and commands natively supported by OtO and their syntax. | TYPE | COMMAND | EXAMPLES | | ----- | ----------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------- | | midi | [note] | /midi:e2 Will trigger note e2 with default velocity (127)<br>/midi:c#4(0) will trigger note C#4 with a velocity of 0 (which pratically means a noteOff) | | midi | [cc number] | /midi:cc11 Will trigger midi CC11 with default value (127)<br>/midi:cc2(64) will trigger a CC2 event with a value of 64 | | ppt | [slide] | /ppt:3 Will go to slide 3 | | ppt | next | /ppt:next (next slide) | | ppt | previous | /ppt:previous (previous slide) | | ppt | first | /ppt:first | | ppt | last | /ppt:last | | timer | [HHMMSS] | /timer:002004 Will set the timer to 00:20:04 ) | | timer | reset | /timer:reset | | timer | pause | /timer:pause | | note | [any] | /note:welcome Does nothing specific, for testing and demos purposes | ## Group actions syntax You can group two actionMarkers with the following syntax: /group:command|group2:command2 This allows you to trigger multiple actions simultaneously. Here's how it works: - / – Starts the actionMarker. - group:command The first group and its associated command. - | The \"pipe\" symbol separates different actionMarkers, allowing multiple commands to be grouped together (note that you DO NOT start the second actionMarker with another / ) - group2:command2 – The second group and its associated command (it can be any valid group:command couple, including the same couple than the first actionMarker) Example: If you want to change to next slide and play a sound simultaneously, the actionMarker would look like this: /ppt:next|midi:e2 ## Manual triggering There are 3 different ways of manually triggering an action Marker 1. You can disable the \"Trigger Marker Action on Scroll\" option in:<br> ⚙ Settings -> Markers and Timers -> Advanced Settings for Action Markers.<br> This way, markers will no longer activate on scroll but instead will be triggered by clicking the target button next to the marker name, which will change to a \"play\" button in this mode (double-click on it to actually trigger the marker). This mode can be very useful for rehearsals, for example, where you may not want to trigger events at every turn. 2. Also, whatever the mode you're in (prompting mode or not), you can always trigger any action marker by right clicking the marker's name and then select Trigger Marker 3. Finally, you can trigger the next action Marker (from the current position perspective) with the keyboard shortcut CTRL+SHIFT+T or ⌘+SHIFT+T on mac",
    "slug": "docs/markers/action-markers"
  },
  {
    "title": "How do Action Markers work?",
    "content": "ActionMarkers are just like other markers, except they trigger events (like passing slides, playing videos or sounds etc.) when the text scrolls and the marker passes in front of the ▶ cue indicator. ActionMarkers are first created as standard markers, meaning you need to select a portion of text and then either click the button or use the shortcut CTRL + M or ⌘ + M. Afterward, to \"convert\" them into Action Markers, you must use a specific syntax, as explained below. This syntax determines the type of action the marker will trigger, allowing you to control external events, such as slides, sounds, or videos, during your presentation. ActionMarkers are automatically triggered in prompter mode only, when the text scrolls and the marker passes in front of the ▶ cue indicator. This ensures that actions are executed precisely at the right moment during the presentation or performance, aligned with the speaker's pace. The trigger is signaled by a slight flash lasting about one second. type=tip You may still manually trigger action markers on certain conditions, see below to know how type=info MARKER OFFSET SHIFT The actionMarkers will be triggered as the text scrolls and the marker passes in front of the ▶ cue indicator. You can fine-tune the vertical offset (relative to the ▶ cue indicator position) in the margins dropdown. Click icon in the toolbar and enter a positive or negative value in the \"Action Marker vertical Offset in pixels\"",
    "slug": "docs/markers/action-markers#how-do-action-markers-work"
  },
  {
    "title": "Time to next ActionMarker",
    "content": "When the Show timer option is enabled (Option Menu → then Show Timer), the remaining time before the next Action Marker will be displayed as a countdown and will adjust according to the scrolling speed. This allows you—and potentially your team—to anticipate the upcoming event. It can be a valuable tool for cue operators, speakers, and stage managers! You may also display (or hide) this countdown on the prompter window or external screen. To do so, go to ⚙ Settings -> Markers and Timers -> then Show markers on external display, and enable \"Show Time to Next Action Marker\". See the Overlay chapter to get more detailed informations. type=warning Be aware that the countdown to the next marker will only be displayed when it is less than 150 seconds away.",
    "slug": "docs/markers/action-markers#time-to-next-actionmarker"
  },
  {
    "title": "Action Marker Features",
    "content": "Action Markers can trigger several types of events, and we will continue to expand this list with future updates: MIDI MIDI actions allow you to trigger MIDI events such as noteOn, noteOff, or a controller event (CC). This enables communication with a wide variety of devices for coordinating sound and lighting. Refer to the documentation of the equipment or software you wish to control to understand how it responds to these types of instructions. Some well-known sound and lighting equipment for large events that can be controlled via MIDI include: Pioneer DJ Mixers and Controllers for automated sound effects and transitions Martin Professional Lighting Controllers for synchronized lighting effects Ableton Live for triggering audio and visual cues during live performances PowerPoint You can easily control any PowerPoint presentation with OtO. Refer to the dedicated commands below as well as the PowerPoint setup guide for more details. OSC Servers and HTTP Servers Beyond MIDI, you can communicate with audio or video systems that support the OSC (Open Sound Control) protocol or use a message translator like Osculator or atemOSC by BanyanAV to control Blackmagic™ Atem™ video switchers. Similarly, you can send any conceivable request via the HTTP protocol to control external devices. All of this is covered in the \"Network Markers\" section. Timers It is possible to control the display of the OtO timer, set it to a specific time, pause it, or restart it as needed.",
    "slug": "docs/markers/action-markers#action-marker-features"
  },
  {
    "title": "Creating an Action Marker",
    "content": "Creating an action marker differs slightly from standard markers and requires specific syntax. First you need to create a standard Marker, then you should enter a special description The syntax to enter as a description for creating an actionMarker can be defined as follows: /group:command(option) Here’s a breakdown of this structure: / Every actionMarker starts with a slash. group – Refers to the type of command, such as controlling slides, playing sounds, or triggering other events (see below for a list of compatible groups and commands) command – Specifies the exact action to be executed within the group, such as advancing to a particular slide or starting a video. (option) – Optional parameters between parenthesis that refine the command, such as slide numbers, sound files, or lighting settings. Example:<br> To trigger the midi note E2 with a velocity of 120 (assuming you've set up a working midi device), the command would be:<br> /midi:e2(120) In this case: midi is the group. e2 is the command to trigger the E2 note (120) is the option, specifying the velocity level This flexible syntax allows OtO to manage a wide range of actions based on the needs of your presentation or performance.",
    "slug": "docs/markers/action-markers#creating-an-action-marker"
  },
  {
    "title": "Default actions syntax",
    "content": "Here is the list of command types and commands natively supported by OtO and their syntax. TYPE COMMAND EXAMPLES midi [note] /midi:e2 Will trigger note e2 with default velocity (127)<br>/midi:c#4(0) will trigger note C#4 with a velocity of 0 (which pratically means a noteOff) midi [cc number] /midi:cc11 Will trigger midi CC11 with default value (127)<br>/midi:cc2(64) will trigger a CC2 event with a value of 64 ppt [slide] /ppt:3 Will go to slide 3 ppt next /ppt:next (next slide) ppt previous /ppt:previous (previous slide) ppt first /ppt:first ppt last /ppt:last timer [HHMMSS] /timer:002004 Will set the timer to 00:20:04 ) timer reset /timer:reset timer pause /timer:pause note [any] /note:welcome Does nothing specific, for testing and demos purposes",
    "slug": "docs/markers/action-markers#default-actions-syntax"
  },
  {
    "title": "Group actions syntax",
    "content": "You can group two actionMarkers with the following syntax: /group:command|group2:command2 This allows you to trigger multiple actions simultaneously. Here's how it works: / – Starts the actionMarker. group:command The first group and its associated command. | The \"pipe\" symbol separates different actionMarkers, allowing multiple commands to be grouped together (note that you DO NOT start the second actionMarker with another / ) group2:command2 – The second group and its associated command (it can be any valid group:command couple, including the same couple than the first actionMarker) Example: If you want to change to next slide and play a sound simultaneously, the actionMarker would look like this: /ppt:next|midi:e2",
    "slug": "docs/markers/action-markers#group-actions-syntax"
  },
  {
    "title": "Manual triggering",
    "content": "There are 3 different ways of manually triggering an action Marker You can disable the \"Trigger Marker Action on Scroll\" option in:<br> ⚙ Settings -> Markers and Timers -> Advanced Settings for Action Markers.<br> This way, markers will no longer activate on scroll but instead will be triggered by clicking the target button next to the marker name, which will change to a \"play\" button in this mode (double-click on it to actually trigger the marker). This mode can be very useful for rehearsals, for example, where you may not want to trigger events at every turn. Also, whatever the mode you're in (prompting mode or not), you can always trigger any action marker by right clicking the marker's name and then select Trigger Marker Finally, you can trigger the next action Marker (from the current position perspective) with the keyboard shortcut CTRL+SHIFT+T or ⌘+SHIFT+T on mac",
    "slug": "docs/markers/action-markers#manual-triggering"
  },
  {
    "title": "Network Action Markers",
    "content": "Network Action Markers OtO allows you to go even further than the predefined actionMarkers discussed in the previous chapter, by enabling you to connect to any OSC or HTTP server. This allows you to trigger actions, such as playing a sound in Ableton Live® or starting a video on a BlackMagic Atem®. In OtO, this is called a Network Action Marker. ## Creating a Static Network Action Marker Let’s walk through an example to better understand how to create these custom markers. Custom action markers function just like \"regular\" actionMarkers, but you need to define their specific details beforehand. Let’s assume you want to control a Blackmagic HyperDeck using the excellent Banyan AVBridge. According to the documentation, the OSC command to send is /hyperdeck/play-single-clip/{x}, where {x} refers to the video number in the HyperDeck. We will first create a \"static\" custom marker, meaning a marker with a single command to trigger one action, for example, to play video number 2. Note the IP Note the IP\"|orientation=\"vertical\" Note the IP address of the machine you want to connect to, as well as the port (the default is port 3333). Add the New Marker Add the New Marker\"|orientation=\"vertical\" In OtO, go to the settings and click the green \"Add\" button. A modal window will appear with various fields: Fill the required information Fill the required information\"|orientation=\"vertical\" - In the \"Network Type\" field, choose OSC. - In the \"Port\" field, add the server port or ignore the field for default value - In \"Group name\" field, add something you will remember, like deck - In the \"command\" field, add the actual command, which is just 2 (the video clip we want to trigger) Address/Command configuration Address/Command configuration\"|orientation=\"vertical\" In the \"URL / Address\" field, enter the following: 10.10.7.10/hyperdeck/play-single-clip/ (Replace 10.10.7.10 with the IP address of the remote machine. You should see in the Network Setting Window a new entry below the green button with a reference to the maker we just created (note the trash and pen icon, to respectively edit or delete the marker) Create Marker Create Marker\"|orientation=\"vertical\" Next, create an actionMarker as we discussed in the previous chapter (select one or more words, then press the or use CTRL+M or ⌘+M on mac). Save Save\"|orientation=\"vertical\" Rename it to declare it as an actionMarker, using the syntax group:command. For our example, it would be:/deck:2 We should now be able to trigger our shiny all new actionMarker, as a command that sends the previously defined OSC command to the Blackmagic HyperDeck. When triggered during your presentation, this marker will play the designated clip on the HyperDeck. ## Creating a Dynamic Network Action Marker If you have many videos or events to trigger, it can quickly become tedious and inefficient to configure in the settings panel a new marker each time. In this case, you can create a dynamic marker. Let’s go back to the example of video clips triggered via the address /hyperdeck/play-single-clip/{x}, where \"x\" can be any number (as long as the video exists in the HyperDeck). We will do the same on our side. The creation process is identical to static markers, so follow the steps up to step 5: - Leave the \"command\" field empty (since the command is dynamic and will be interpreted at trigger time). - In the address field, enter: 10.10.7.10:3333/hyperdeck/play-single-clip/{{command}} Here, {{command}} acts as a placeholder, just like {x} in Banyan AVBridge’s documentation, allowing for a variable value. - Save, and you can now quickly create as many markers as you have clips by renaming them, for example, /deck:2, /deck:3, etc. This setup makes it easy to handle multiple dynamic events without needing to manually define each action in advance. type=info HTTP SERVERS http servers work the same way, they're just more customizable since http is a more generic protocol. If you need to connect to an http server, you'll need to refer to the documentation of the server you wish to connect to check what method (POST or GET) is required. You can add headers and body information with a JSON syntax (check the placeholders to get an example of how those should be formatted) ## Advanced options In the intro chapter on action markers, we saw that it was possible to refine a command by specifying an option in parentheses. For example, the marker /midi:e2(120) sends the MIDI command (a note, in this case) E2, and refines this command with the number in parentheses. In the context of MIDI Action Markers, this option is used to specify velocity. In the network Marker creation panel seen above, the placeholder corresponding to this \"option\" is written as {{option}}, just as the placeholder corrsponding to the e2 note/command is written {{command}}. Let’s take the example of Qlab, a well-known Mac-based show control application that supports the OSC protocol. Suppose Qlab is configured to listen for network requests at the address 10.10.7.25 on port 53000. If we create a Network Action Marker with the address /cue/{{command}}/{{option}}, then: the marker /qlab:2(play) will actually send the command /cue/2/play and the marker /qlab:3(stop)will send /cue/3/stop to Qlab This allows for flexible and dynamic control over external applications, adapting commands on the fly based on the marker’s name.",
    "slug": "docs/markers/network-markers"
  },
  {
    "title": "Creating a Static Network Action Marker",
    "content": "Let’s walk through an example to better understand how to create these custom markers. Custom action markers function just like \"regular\" actionMarkers, but you need to define their specific details beforehand. Let’s assume you want to control a Blackmagic HyperDeck using the excellent Banyan AVBridge. According to the documentation, the OSC command to send is /hyperdeck/play-single-clip/{x}, where {x} refers to the video number in the HyperDeck. We will first create a \"static\" custom marker, meaning a marker with a single command to trigger one action, for example, to play video number 2. Note the IP Note the IP\"|orientation=\"vertical\" Note the IP address of the machine you want to connect to, as well as the port (the default is port 3333). Add the New Marker Add the New Marker\"|orientation=\"vertical\" In OtO, go to the settings and click the green \"Add\" button. A modal window will appear with various fields: Fill the required information Fill the required information\"|orientation=\"vertical\" In the \"Network Type\" field, choose OSC. In the \"Port\" field, add the server port or ignore the field for default value In \"Group name\" field, add something you will remember, like deck In the \"command\" field, add the actual command, which is just 2 (the video clip we want to trigger) Address/Command configuration Address/Command configuration\"|orientation=\"vertical\" In the \"URL / Address\" field, enter the following: 10.10.7.10/hyperdeck/play-single-clip/ (Replace 10.10.7.10 with the IP address of the remote machine. You should see in the Network Setting Window a new entry below the green button with a reference to the maker we just created (note the trash and pen icon, to respectively edit or delete the marker) Create Marker Create Marker\"|orientation=\"vertical\" Next, create an actionMarker as we discussed in the previous chapter (select one or more words, then press the or use CTRL+M or ⌘+M on mac). Save Save\"|orientation=\"vertical\" Rename it to declare it as an actionMarker, using the syntax group:command. For our example, it would be:/deck:2 We should now be able to trigger our shiny all new actionMarker, as a command that sends the previously defined OSC command to the Blackmagic HyperDeck. When triggered during your presentation, this marker will play the designated clip on the HyperDeck.",
    "slug": "docs/markers/network-markers#creating-a-static-network-action-marker"
  },
  {
    "title": "Creating a Dynamic Network Action Marker",
    "content": "If you have many videos or events to trigger, it can quickly become tedious and inefficient to configure in the settings panel a new marker each time. In this case, you can create a dynamic marker. Let’s go back to the example of video clips triggered via the address /hyperdeck/play-single-clip/{x}, where \"x\" can be any number (as long as the video exists in the HyperDeck). We will do the same on our side. The creation process is identical to static markers, so follow the steps up to step 5: Leave the \"command\" field empty (since the command is dynamic and will be interpreted at trigger time). In the address field, enter: 10.10.7.10:3333/hyperdeck/play-single-clip/{{command}} Here, {{command}} acts as a placeholder, just like {x} in Banyan AVBridge’s documentation, allowing for a variable value. Save, and you can now quickly create as many markers as you have clips by renaming them, for example, /deck:2, /deck:3, etc. This setup makes it easy to handle multiple dynamic events without needing to manually define each action in advance. type=info HTTP SERVERS http servers work the same way, they're just more customizable since http is a more generic protocol. If you need to connect to an http server, you'll need to refer to the documentation of the server you wish to connect to check what method (POST or GET) is required. You can add headers and body information with a JSON syntax (check the placeholders to get an example of how those should be formatted)",
    "slug": "docs/markers/network-markers#creating-a-dynamic-network-action-marker"
  },
  {
    "title": "Advanced options",
    "content": "In the intro chapter on action markers, we saw that it was possible to refine a command by specifying an option in parentheses. For example, the marker /midi:e2(120) sends the MIDI command (a note, in this case) E2, and refines this command with the number in parentheses. In the context of MIDI Action Markers, this option is used to specify velocity. In the network Marker creation panel seen above, the placeholder corresponding to this \"option\" is written as {{option}}, just as the placeholder corrsponding to the e2 note/command is written {{command}}. Let’s take the example of Qlab, a well-known Mac-based show control application that supports the OSC protocol. Suppose Qlab is configured to listen for network requests at the address 10.10.7.25 on port 53000. If we create a Network Action Marker with the address /cue/{{command}}/{{option}}, then: the marker /qlab:2(play) will actually send the command /cue/2/play and the marker /qlab:3(stop)will send /cue/3/stop to Qlab This allows for flexible and dynamic control over external applications, adapting commands on the fly based on the marker’s name.",
    "slug": "docs/markers/network-markers#advanced-options"
  },
  {
    "title": "Powerpoint and Keynote Markers",
    "content": "Powerpoint and Keynote Markers OtO allows you to control PowerPoint slide transitions in two ways: 1. From the same machine, directly via OtO 2. To any machine running PowerPoint, connected to the same network, via the \"OtOSlides\" utility. ## Controlling PowerPoint Locally To control PowerPoint locally, first make sure to disable the \"Connect to PPT Server\" option in ⚙ Settings -> Network, as this is used for network connectivity and every /ppt marker would then try to trigger a remote PowerPoint server. Then simply launch PowerPoint on your computer and activate slideshow mode. You'll need two screens: the first will be used to control OtO, and the second will be dedicated to displaying the full-screen slideshow. ## Controlloing PowerPoint from network To control the progress of a remote PowerPoint slideshow from OtO, you need to install the small utility \"OtOSlides\" on the machine running the slideshow, which is available for download here. Once this application is installed on the other machine (or it can be the same machine), launch it, take note of the IP address displayed in the application, and set your presentation to full-screen slideshow mode. Launch PowerPoint in slideshow mode, then, back in OtO, go to the ⚙ Settings -> Network then in the field \"Powerpoint Server configuration\", enable the network PowerPoint option, and enter the IP address (the IP will be displayed in otslides user interface). type=info On Mac you can also control keynote by simply switching to Keynote Mode (just click on the 'Application' drowpdown menu in OtoSlides and select Keynote) type=warning If you changed the Server Port in the OtOSlides app, update the Powerpoint Server configuration field accordingly. Simply append the port to the IP address after a colon :. For example, if the IP is 192.168.10.2 and the port is 4001, enter: 192.168.10.2:4001 in the Powerpoint Server configuration settings. You may click on the small button at the end of the field to check if the server responds. Confirm the changes, and you can now control your presentation remotely!) ## Creating a PowerPoint marker To learn how to create a marker, please refer to the dedicated chapter. This chapter will provide detailed instructions and examples to help you understand the process thoroughly. The syntax to enter as a description for creating a powerpoint actionMarker is: /ppt:command Here is the list of command supporterd by OtO and OtO-Slides to control powerpoint. | TYPE | COMMAND | EXAMPLES | | ---- | -------- | -------------------------------- | | ppt | [slide] | /ppt:3 Will go to slide 3 | | ppt | next | /ppt:next (next slide) | | ppt | previous | /ppt:previous (previous slide) | | ppt | first | /ppt:first | | ppt | last | /ppt:last | ## Importing Notes You can also import notes from a .pptX file by navigating to the File menu and selecting Import Notes from .pptX OtO will create a new text document from the powerpoint file, that aggregates all the notes from each slide in the presentation, separated by automatically created /ppt Action Markers corresponding to each slide. This setup allows the PowerPoint presentation to advance seamlessly as you read through the notes. ## Keynote Mode On the Mac version of OtO, You can also trigger Apple Keynote slides. To do so, go to ⚙ Settings -> Markers and click on \"Treat PPT markers as Keynote\". The Action Marker syntax (/ppt:) remains the same. For remote operations, you can simply switch the OtOSlides app to Keynote Mode.",
    "slug": "docs/markers/powerpoint-setup"
  },
  {
    "title": "Controlling PowerPoint Locally",
    "content": "To control PowerPoint locally, first make sure to disable the \"Connect to PPT Server\" option in ⚙ Settings -> Network, as this is used for network connectivity and every /ppt marker would then try to trigger a remote PowerPoint server. Then simply launch PowerPoint on your computer and activate slideshow mode. You'll need two screens: the first will be used to control OtO, and the second will be dedicated to displaying the full-screen slideshow.",
    "slug": "docs/markers/powerpoint-setup#controlling-powerpoint-locally"
  },
  {
    "title": "Controlloing PowerPoint from network",
    "content": "To control the progress of a remote PowerPoint slideshow from OtO, you need to install the small utility \"OtOSlides\" on the machine running the slideshow, which is available for download here. Once this application is installed on the other machine (or it can be the same machine), launch it, take note of the IP address displayed in the application, and set your presentation to full-screen slideshow mode. Launch PowerPoint in slideshow mode, then, back in OtO, go to the ⚙ Settings -> Network then in the field \"Powerpoint Server configuration\", enable the network PowerPoint option, and enter the IP address (the IP will be displayed in otslides user interface). type=info On Mac you can also control keynote by simply switching to Keynote Mode (just click on the 'Application' drowpdown menu in OtoSlides and select Keynote) type=warning If you changed the Server Port in the OtOSlides app, update the Powerpoint Server configuration field accordingly. Simply append the port to the IP address after a colon :. For example, if the IP is 192.168.10.2 and the port is 4001, enter: 192.168.10.2:4001 in the Powerpoint Server configuration settings. You may click on the small button at the end of the field to check if the server responds. Confirm the changes, and you can now control your presentation remotely!)",
    "slug": "docs/markers/powerpoint-setup#controlloing-powerpoint-from-network"
  },
  {
    "title": "Creating a PowerPoint marker",
    "content": "To learn how to create a marker, please refer to the dedicated chapter. This chapter will provide detailed instructions and examples to help you understand the process thoroughly. The syntax to enter as a description for creating a powerpoint actionMarker is: /ppt:command Here is the list of command supporterd by OtO and OtO-Slides to control powerpoint. TYPE COMMAND EXAMPLES ppt [slide] /ppt:3 Will go to slide 3 ppt next /ppt:next (next slide) ppt previous /ppt:previous (previous slide) ppt first /ppt:first ppt last /ppt:last",
    "slug": "docs/markers/powerpoint-setup#creating-a-powerpoint-marker"
  },
  {
    "title": "Importing Notes",
    "content": "You can also import notes from a .pptX file by navigating to the File menu and selecting Import Notes from .pptX OtO will create a new text document from the powerpoint file, that aggregates all the notes from each slide in the presentation, separated by automatically created /ppt Action Markers corresponding to each slide. This setup allows the PowerPoint presentation to advance seamlessly as you read through the notes.",
    "slug": "docs/markers/powerpoint-setup#importing-notes"
  },
  {
    "title": "Keynote Mode",
    "content": "On the Mac version of OtO, You can also trigger Apple Keynote slides. To do so, go to ⚙ Settings -> Markers and click on \"Treat PPT markers as Keynote\". The Action Marker syntax (/ppt:) remains the same. For remote operations, you can simply switch the OtOSlides app to Keynote Mode.",
    "slug": "docs/markers/powerpoint-setup#keynote-mode"
  },
  {
    "title": "Default Keyboard Shortcuts",
    "content": "Default Keyboard Shortcuts ## Default shortcuts ### Edition mode |Command |MAC |PC | |---------------------------------------------|------------------------|--------------------------| |New Project |⌘ + N |CTRL + N | |Import Word document(s) |⌘ + SHIFT + I |CTRL + SHIFT + I | |Open project |⌘ + O |CTRL + O | |Save project |⌘ + S |CTRL + S | |Undo |⌘ + Z |CTRL + Z | |Toggle external window full Screen |⌘ + Enter |F11 | |Search Text |⌘ + F |CTRL + F | |Jump in place to Editor/Preview |⌘ + ⌥ + J |CTRL + Alt + J | |Toggle Sync Preview Mode |⌘ + ⌥ + S |CTRL + Alt + S | |Search Text |⌘ + F |CTRL + F | |Toggle prompting Mode |⌘ + P |CTRL + P | |Trigger next Action Marker |⌘ + SHIFT + T |CTRL + SHIFT + T | |Toggle Presenter / Standard Marker |⌘ + ⌥ + M |CTRL+ ALT + M | |Select All Paragraph text / All Document Text|⌘ + A |CTRL + A | |Bold Text |⌘ + B |CTRL + B | |Italics Text |⌘ + I |CTRL + I | |Add a line break |SHIFT + Enter |SHIFT + Enter | |Toggle Highlight |⌘ + SHIFT + H |CTRL + SHIFT + H | |Set default color 1...5 |⌘ + ⌥ + 1<br>(or 2,3,4,5)|CTRL +ALT + 1<br>(or 2,3,4,5)| ### Prompting mode |Command |MAC |PC | |---------------------------------------------|------------------------|--------------------------| |Toggle prompting Mode |⌘ + P |CTRL + P | |Go to previous document |⌘ + ⌥ + UP |CTRL + ALT + UP | |Go to next document |⌘ + ⌥ + DOWN |CTRL + ALT + DOWN | |Faster |⌘ + UP |CTRL + UP | |Slower |⌘ + DOWN |CTRL + DOWN | |Reverse direction |⌘ + ENTER |CTRL + ENTER | |Pause |⌘ + Delete |CTRL + Backspace | |Next Marker |⌘ + PageDown |CTRL + PageDown | |Previous Maker |⌘ + PageUp |CTRL + PageUp | |Trigger next Action Marker |⌘ + SHIFT + T |CTRL + SHIFT + T |",
    "slug": "docs/advanced/shortcuts"
  },
  {
    "title": "Default shortcuts",
    "content": "Edition mode Command MAC PC New Project ⌘ + N CTRL + N Import Word document(s) ⌘ + SHIFT + I CTRL + SHIFT + I Open project ⌘ + O CTRL + O Save project ⌘ + S CTRL + S Undo ⌘ + Z CTRL + Z Toggle external window full Screen ⌘ + Enter F11 Search Text ⌘ + F CTRL + F Jump in place to Editor/Preview ⌘ + ⌥ + J CTRL + Alt + J Toggle Sync Preview Mode ⌘ + ⌥ + S CTRL + Alt + S Search Text ⌘ + F CTRL + F Toggle prompting Mode ⌘ + P CTRL + P Trigger next Action Marker ⌘ + SHIFT + T CTRL + SHIFT + T Toggle Presenter / Standard Marker ⌘ + ⌥ + M CTRL+ ALT + M Select All Paragraph text / All Document Text ⌘ + A CTRL + A Bold Text ⌘ + B CTRL + B Italics Text ⌘ + I CTRL + I Add a line break SHIFT + Enter SHIFT + Enter Toggle Highlight ⌘ + SHIFT + H CTRL + SHIFT + H Set default color 1...5 ⌘ + ⌥ + 1<br>(or 2,3,4,5) CTRL +ALT + 1<br>(or 2,3,4,5) Prompting mode Command MAC PC Toggle prompting Mode ⌘ + P CTRL + P Go to previous document ⌘ + ⌥ + UP CTRL + ALT + UP Go to next document ⌘ + ⌥ + DOWN CTRL + ALT + DOWN Faster ⌘ + UP CTRL + UP Slower ⌘ + DOWN CTRL + DOWN Reverse direction ⌘ + ENTER CTRL + ENTER Pause ⌘ + Delete CTRL + Backspace Next Marker ⌘ + PageDown CTRL + PageDown Previous Maker ⌘ + PageUp CTRL + PageUp Trigger next Action Marker ⌘ + SHIFT + T CTRL + SHIFT + T",
    "slug": "docs/advanced/shortcuts#default-shortcuts"
  },
  {
    "title": "Overlays",
    "content": "Overlays ## Time Bar When this option is enabled (Menu -> Show timer or ⚙ Settings -> Markers and Timers -> Timers -> \"Show Timer\"), an overlay bar will appear at the top of the Prompter Editor . This time bar contains: - A timer in the format HH:MM:SS:ii - In prompter mode only: a countdown indicating the time remaining until the next Action Marker type=info When the option is enabled, the timer is also visible on the prompter screen at the bottom of the window (the top area is reserved for document information). To show or hide the Action Markers countdown, go to ⚙ Settings -> Markers and Timers -> Show markers on external display, and enable \"Show Time to Next Action Marker\". ### Action Marker Countdown When using Action Markers, a countdown will appear in the time bar, showing the time remaining until the next Action Marker: - It becomes active when there are less than 2 minutes and 30 seconds (150 seconds) before the next marker. - It displays the name of the next marker. - The remaining time is proportional to the scrolling speed. ## Title Bar For the prompter screen only, another horizontal overlay bar, the title bar, displays: 1. The document number, the total number of documents, and the title of the current document. 2. A progress indicator in percentage, relative to the current document, along with a global progress indicator. You can choose to display either (or none) of these elements by going to ⚙ Settings -> Markers and Timers -> Prompter Screen Overlay Metadata.",
    "slug": "docs/advanced/overlays"
  },
  {
    "title": "Time Bar",
    "content": "When this option is enabled (Menu -> Show timer or ⚙ Settings -> Markers and Timers -> Timers -> \"Show Timer\"), an overlay bar will appear at the top of the Prompter Editor . This time bar contains: A timer in the format HH:MM:SS:ii In prompter mode only: a countdown indicating the time remaining until the next Action Marker type=info When the option is enabled, the timer is also visible on the prompter screen at the bottom of the window (the top area is reserved for document information). To show or hide the Action Markers countdown, go to ⚙ Settings -> Markers and Timers -> Show markers on external display, and enable \"Show Time to Next Action Marker\". Action Marker Countdown When using Action Markers, a countdown will appear in the time bar, showing the time remaining until the next Action Marker: It becomes active when there are less than 2 minutes and 30 seconds (150 seconds) before the next marker. It displays the name of the next marker. The remaining time is proportional to the scrolling speed.",
    "slug": "docs/advanced/overlays#time-bar"
  },
  {
    "title": "Title Bar",
    "content": "For the prompter screen only, another horizontal overlay bar, the title bar, displays: The document number, the total number of documents, and the title of the current document. A progress indicator in percentage, relative to the current document, along with a global progress indicator. You can choose to display either (or none) of these elements by going to ⚙ Settings -> Markers and Timers -> Prompter Screen Overlay Metadata.",
    "slug": "docs/advanced/overlays#title-bar"
  },
  {
    "title": "Network Mode",
    "content": "Network Mode OtO allows you to synchronize multiple computers. This provides added security during your session, as you can seamlessly switch to another machine if one fails. You may also connect the OtOView app to OtO, allowing you to display the teleprompter screen over the network, either wired or wirelessly, on a smartphone or tablet. You can also set up, for example, a multi-screen display system (for a speaker/lectern/presidential prompter, for instance) using two OtO computers dedicated to display on these screens. Simply launch OtO, connect them to the 'master,' then activate the prompter window and switch it to full screen. Even if these computers only have a single display, being able to set the prompter window to full screen allows you to transform an OtO client into a remote prompter display! Unlike other presentation or teleprompter software, OtO operates in a peer-to-peer (P2P) mode rather than a client-server setup. All computers are interconnected directly, without relying on a server. Advantages of Peer-to-Peer Architecture: - Increased Security: The risk of failure is distributed across all connected machines, unlike in client-server architecture, where a server failure could take down the entire system. - Ease of Use: It’s simpler to set up and less cumbersome in terms of cabling and devices, speeding up the deployment process. ## Required Hardware - At least two computers that meet OtO's minimum system requirements - All computers should run the same operating system (either MacOS or Windows) and have matching screen resolution across all computers - All computers must be connected to the same network - Display: when prompting in network mode, you'll either need: - a video switch, HDMI, or other types of switches to toggle the teleprompter display when switching from one computer to another. Here are a few examples of robust and professional-grade HDMI and SDI switches (Blackmagic Design ATEM Mini Pro, Roland V-1HD HD Video Switcher, AJA KUMO 1616 SDI Router or Decimator Design DMON-QUAD for instance) - or a connected android display with OtOView installed if you want to go wireless - One or more other connected OtO computers acting as standalone displays by setting their prompter external window in fullscreen (AIO PCs are quite good candidates for this job) ## Master and Leading Computers Master Computer Although OtO’s peer-to-peer architecture doesn’t rely on a server, the concept of a Master Computer still exists. The master computer acts like a traffic controller: the other computers (the client computers) connect to it and receive the necessary information to establish the OtO peer-to-peer network. Once all computers are connected, the network becomes fully peer-to-peer, meaning even the master can fail without disrupting the network. Follow the guide below to understand how to set up your computer as a master or client computer, and establish a network connection. Unlock the UI Once the connection between the master and client computers is established, all computers share the same document with the same scroll position. If you scroll the document on one computer, all others will scroll to the same position. Similarly, if you make a modification from any computer, it will be reflected on all others. However, please note that by default, all client computers have their interface locked to prevent accidental changes, especially when you use the network mode to bypass potential failures rather than for a fully collaborative environment. You can unlock the interface of the client computers at any time by clicking the network icon , then selecting Unlock UI, effectively transforming OtO in a collaborative presentation / teleprompter software! Leading computer Finally, if you are using Action Markers, please note that only one computer should trigger them (otherwise, an Action Marker that moves to the next slide in a PowerPoint would be triggered as many times as there are connected computers, which is not the desired result!). This is where the concept of a \"leading\" computer comes into play. You can choose at any time which computer will trigger these actions by clicking the network icon and then selecting Take over. ## Activating the Network Activating network mode is simple but must imperatively be done in the correct order: 1. Ensure all computers are connected to the same network. 2. In the network settings ( ⚙ Settings → Network), activate the network option (\"Enable OtO Network\"), and note the displayed IP address. 3. If this is the main (master) computer, check the option \"Set this computer as OtO Network Master\"; if it's a client, leave this unchecked. 4. For client computers, enter the master computer's IP address in the OtO Master URL field. 5. Save your changes. Your documents are now synchronized!. 6. Prompt and edit from the master computer—clients will automatically sync. 7. To set a computer to leading mode, click the network icon in the navigation bar and choose \"Take over\" from the dropdown menu. ## Network Status <center> <small><em>Network DropDown Menu, master and client versions</em></small> </center> To access the network status dropdown, click the icon in the toolbar - The \"Status\" line shows whether the computer is a master or client. - The / button allows you to set the current computer to a Leading computer. As there can be only one leading computer, this will effectively toggle off the leading mode of the other computer, and the button becomes inactive, displaying \"Currently leading.\" - The \"This machine IP\" line shows your machine's IP address. - On the master computer, the button generates a QR code. Scan it with the OtOView mobile app to turn any smartphone or tablet into a teleprompter display. - Finally, you'll find a list of all connected peers with their statuses explained below: | COLOR | STATUS | |-----------------------|---------------------------------| | | Master computer, online | | | Client computer, online | | | Offline computer | ## OtOView OtOView is an android mobile app developed specifically for OtO. Simple to use, it allows you to connect a tablet or smartphone (or even several devices!) to an OtO \"master\" computer that controls the scrolling of the text. This enables two main use cases: 1. Allows a speaker with a tablet or smartphone to move freely on stage or in a studio without having to rely solely on a camera prompter or speaker prompter. 2. Use a tablet as a wireless camera prompter screen. How to use OtOView: - Set up an OtO computer as the network \"master\". - Download the app from the Google PlayStore (it will soon be available for Apple tablets and smartphones). - Ensure the tablet or smartphone is connected to the same Wi-Fi network. - From OtO’s network menu of the Master computer click on the button . - Scan this QRCode from the mobile app by clicking on then on . - You’re connected, and the device will now appear in the list of network devices. - Repeat the procedure to connect other phones or tablets. OtOView Options - By clicking on and then on , you access options to show or hide specific information. ### Troubleshooting - Most network connection issues arise from incorrect connection order. Be sure to follow the steps outlined above. - Note that some connected computers or mobile devices may not immediately appear as offline after exiting or if the app crashes. - It's recommended not to connect more than roughly a dozen of devices (mobiles and computers combined) at once. OtO’s serverless network architecture requires a full mesh topology, which could cause issues if too many machines are interconnected. Also, take a look at the faq section",
    "slug": "docs/advanced/network"
  },
  {
    "title": "Required Hardware",
    "content": "At least two computers that meet OtO's minimum system requirements All computers should run the same operating system (either MacOS or Windows) and have matching screen resolution across all computers All computers must be connected to the same network Display: when prompting in network mode, you'll either need: a video switch, HDMI, or other types of switches to toggle the teleprompter display when switching from one computer to another. Here are a few examples of robust and professional-grade HDMI and SDI switches (Blackmagic Design ATEM Mini Pro, Roland V-1HD HD Video Switcher, AJA KUMO 1616 SDI Router or Decimator Design DMON-QUAD for instance) or a connected android display with OtOView installed if you want to go wireless One or more other connected OtO computers acting as standalone displays by setting their prompter external window in fullscreen (AIO PCs are quite good candidates for this job)",
    "slug": "docs/advanced/network#required-hardware"
  },
  {
    "title": "Master and Leading Computers",
    "content": "Master Computer Although OtO’s peer-to-peer architecture doesn’t rely on a server, the concept of a Master Computer still exists. The master computer acts like a traffic controller: the other computers (the client computers) connect to it and receive the necessary information to establish the OtO peer-to-peer network. Once all computers are connected, the network becomes fully peer-to-peer, meaning even the master can fail without disrupting the network. Follow the guide below to understand how to set up your computer as a master or client computer, and establish a network connection. Unlock the UI Once the connection between the master and client computers is established, all computers share the same document with the same scroll position. If you scroll the document on one computer, all others will scroll to the same position. Similarly, if you make a modification from any computer, it will be reflected on all others. However, please note that by default, all client computers have their interface locked to prevent accidental changes, especially when you use the network mode to bypass potential failures rather than for a fully collaborative environment. You can unlock the interface of the client computers at any time by clicking the network icon , then selecting Unlock UI, effectively transforming OtO in a collaborative presentation / teleprompter software! Leading computer Finally, if you are using Action Markers, please note that only one computer should trigger them (otherwise, an Action Marker that moves to the next slide in a PowerPoint would be triggered as many times as there are connected computers, which is not the desired result!). This is where the concept of a \"leading\" computer comes into play. You can choose at any time which computer will trigger these actions by clicking the network icon and then selecting Take over.",
    "slug": "docs/advanced/network#master-and-leading-computers"
  },
  {
    "title": "Activating the Network",
    "content": "Activating network mode is simple but must imperatively be done in the correct order: Ensure all computers are connected to the same network. In the network settings ( ⚙ Settings → Network), activate the network option (\"Enable OtO Network\"), and note the displayed IP address. If this is the main (master) computer, check the option \"Set this computer as OtO Network Master\"; if it's a client, leave this unchecked. For client computers, enter the master computer's IP address in the OtO Master URL field. Save your changes. Your documents are now synchronized!. Prompt and edit from the master computer—clients will automatically sync. To set a computer to leading mode, click the network icon in the navigation bar and choose \"Take over\" from the dropdown menu.",
    "slug": "docs/advanced/network#activating-the-network"
  },
  {
    "title": "Network Status",
    "content": "<center> <small><em>Network DropDown Menu, master and client versions</em></small> </center> To access the network status dropdown, click the icon in the toolbar The \"Status\" line shows whether the computer is a master or client. The / button allows you to set the current computer to a Leading computer. As there can be only one leading computer, this will effectively toggle off the leading mode of the other computer, and the button becomes inactive, displaying \"Currently leading.\" The \"This machine IP\" line shows your machine's IP address. On the master computer, the button generates a QR code. Scan it with the OtOView mobile app to turn any smartphone or tablet into a teleprompter display. Finally, you'll find a list of all connected peers with their statuses explained below: COLOR STATUS Master computer, online Client computer, online Offline computer",
    "slug": "docs/advanced/network#network-status"
  },
  {
    "title": "OtOView",
    "content": "OtOView is an android mobile app developed specifically for OtO. Simple to use, it allows you to connect a tablet or smartphone (or even several devices!) to an OtO \"master\" computer that controls the scrolling of the text. This enables two main use cases: Allows a speaker with a tablet or smartphone to move freely on stage or in a studio without having to rely solely on a camera prompter or speaker prompter. Use a tablet as a wireless camera prompter screen. How to use OtOView: Set up an OtO computer as the network \"master\". Download the app from the Google PlayStore (it will soon be available for Apple tablets and smartphones). Ensure the tablet or smartphone is connected to the same Wi-Fi network. From OtO’s network menu of the Master computer click on the button . Scan this QRCode from the mobile app by clicking on then on . You’re connected, and the device will now appear in the list of network devices. Repeat the procedure to connect other phones or tablets. OtOView Options By clicking on and then on , you access options to show or hide specific information. Troubleshooting Most network connection issues arise from incorrect connection order. Be sure to follow the steps outlined above. Note that some connected computers or mobile devices may not immediately appear as offline after exiting or if the app crashes. It's recommended not to connect more than roughly a dozen of devices (mobiles and computers combined) at once. OtO’s serverless network architecture requires a full mesh topology, which could cause issues if too many machines are interconnected. Also, take a look at the faq section",
    "slug": "docs/advanced/network#otoview"
  },
  {
    "title": "FAQ and Troubleshooting",
    "content": "FAQ and Troubleshooting ## Prompter display Keyboard shortcuts do not work when prompting It's likely you're focused in an editor window. You need to click elsewhere in the app (in any empty znoe) for the keyboard shortcuts to work. How to disable the prompter window fullscreen Go the Options menu then click on Toggle display fullscreen ## Licensing Are licenses tied to an operating system? No, you may use your license on Windows or Mac OtO Editions and even deactivate your license from one before reactivating on the other. How can I find out when my license expires? On Mac, go the OtO Menu (on Windows go to the Help menu instead) then click on \"About my license...\" ## Action Markers When I navigate between markers, is it possible to land just before Action Markers so they don't trigger immediately? Yes, refer to the editing / Setting Margins and Offsets section. ## PowerPoint Markers Local PowerPoint slides do not trigger First, make sure to disable the \"Connect to PPT Server\" option in Settings -> Network, as this is used for network connectivity and every /ppt marker would then try to trigger a remote PowerPoint server. Also, make sur that your PowerPoint presentation is in slideshow mode. Remote PowerPoint slides do not trigger Make sure the port in the OtO Slide Controller matches the one set in OtO in ⚙ Settings → Network → * *. To do so, simply append the port to the IP address after a colon :. For example, if the IP of the *OtO Slide Controller* machine is 192.168.10.2 and the port is 4001, enter: 192.168.10.2:4001 in the Powerpoint Connect configuration settings of the OtO Machine. ## Editing Can I import Powerpoint files? What you can do is import a .pptx file, which will only import the notes of that .pptx and place PPT Action Markers between each slide content The progress indicator is jumping aroung and reports wrong values If this happens, click on the topmost ... dots in the Rudown Panel, and select \"Refresh Progress\" ## Network In network mode, can I connect different computers with different OS and resolutions? In theory, yes, you can connect computers with different operating systems and resolutions. We've worked hard to ensure high display fidelity across various types of computers. However, if you've chosen OtO, it's likely because you want to provide the highest level of security for your clients. The best way to ensure that level of reliability is to use computers of the same series, running the same operating system and with matching screen resolutions. I installed the \"OtOView\" app on my mobile device but I can't see the QRCode Ensure you've enabled Network Mode in ⚙ Settings → Network then Enable OtO network, and also Set this computer as OtO network Master. Save settings. Then from OtO’s network settings dropdown , click on the button . ## Settings How can I save or load my personal settings on another computer? In the Options menu, select Open User Folder. This will open a file explorer or Finder window (on Mac) with the OtO folder. Inside this folder, you will find a file named \"settings.json\". Copy it (on any support / platform) and overwrite the existing one on the other computer (by opening the \"User Folder\" again). ## Performance Issues OtO is slow * Start by ensuring that OtO meets the minimum recommended specifications mentioned in this chapter. * Often, the graphics card in your computer is configured to handle hardware acceleration for only one screen. In this case, we recommend setting the external screen as the primary display (and switching back if this is already the case). You can find instructions for performing this operation here: * For Windows * For Mac * Lower the resolution of the teleprompter screen. * Close other applications.”",
    "slug": "docs/advanced/faq"
  },
  {
    "title": "Prompter display",
    "content": "Keyboard shortcuts do not work when prompting It's likely you're focused in an editor window. You need to click elsewhere in the app (in any empty znoe) for the keyboard shortcuts to work. How to disable the prompter window fullscreen Go the Options menu then click on Toggle display fullscreen",
    "slug": "docs/advanced/faq#prompter-display"
  },
  {
    "title": "Licensing",
    "content": "Are licenses tied to an operating system? No, you may use your license on Windows or Mac OtO Editions and even deactivate your license from one before reactivating on the other. How can I find out when my license expires? On Mac, go the OtO Menu (on Windows go to the Help menu instead) then click on \"About my license...\"",
    "slug": "docs/advanced/faq#licensing"
  },
  {
    "title": "Action Markers",
    "content": "When I navigate between markers, is it possible to land just before Action Markers so they don't trigger immediately? Yes, refer to the editing / Setting Margins and Offsets section.",
    "slug": "docs/advanced/faq#action-markers"
  },
  {
    "title": "PowerPoint Markers",
    "content": "Local PowerPoint slides do not trigger First, make sure to disable the \"Connect to PPT Server\" option in Settings -> Network, as this is used for network connectivity and every /ppt marker would then try to trigger a remote PowerPoint server. Also, make sur that your PowerPoint presentation is in slideshow mode. Remote PowerPoint slides do not trigger Make sure the port in the OtO Slide Controller matches the one set in OtO in ⚙ Settings → Network → * *. To do so, simply append the port to the IP address after a colon :. For example, if the IP of the *OtO Slide Controller* machine is 192.168.10.2 and the port is 4001, enter: 192.168.10.2:4001 in the Powerpoint Connect configuration settings of the OtO Machine.",
    "slug": "docs/advanced/faq#powerpoint-markers"
  },
  {
    "title": "Editing",
    "content": "Can I import Powerpoint files? What you can do is import a .pptx file, which will only import the notes of that .pptx and place PPT Action Markers between each slide content The progress indicator is jumping aroung and reports wrong values If this happens, click on the topmost ... dots in the Rudown Panel, and select \"Refresh Progress\"",
    "slug": "docs/advanced/faq#editing"
  },
  {
    "title": "Network",
    "content": "In network mode, can I connect different computers with different OS and resolutions? In theory, yes, you can connect computers with different operating systems and resolutions. We've worked hard to ensure high display fidelity across various types of computers. However, if you've chosen OtO, it's likely because you want to provide the highest level of security for your clients. The best way to ensure that level of reliability is to use computers of the same series, running the same operating system and with matching screen resolutions. I installed the \"OtOView\" app on my mobile device but I can't see the QRCode Ensure you've enabled Network Mode in ⚙ Settings → Network then Enable OtO network, and also Set this computer as OtO network Master. Save settings. Then from OtO’s network settings dropdown , click on the button .",
    "slug": "docs/advanced/faq#network"
  },
  {
    "title": "Settings",
    "content": "How can I save or load my personal settings on another computer? In the Options menu, select Open User Folder. This will open a file explorer or Finder window (on Mac) with the OtO folder. Inside this folder, you will find a file named \"settings.json\". Copy it (on any support / platform) and overwrite the existing one on the other computer (by opening the \"User Folder\" again).",
    "slug": "docs/advanced/faq#settings"
  },
  {
    "title": "Performance Issues",
    "content": "OtO is slow Start by ensuring that OtO meets the minimum recommended specifications mentioned in this chapter. Often, the graphics card in your computer is configured to handle hardware acceleration for only one screen. In this case, we recommend setting the external screen as the primary display (and switching back if this is already the case). You can find instructions for performing this operation here: For Windows For Mac Lower the resolution of the teleprompter screen. Close other applications.”",
    "slug": "docs/advanced/faq#performance-issues"
  },
  {
    "title": "Example setups",
    "content": "Example setups OtO is a versatile tool that can be configured in countless ways to meet the unique demands of different setups—whether for broadcasting, live events, or stage presentations. This section presents a range of connection examples to illustrate how OtO can streamline workflows, from remote-triggered events between two computers to HDMI and wireless tablet displays. With OtO, nearly any combination of devices and displays is possible, allowing for truly customized, seamless presentation environments across multiple screens and devices. ## IP + HDMI ## Full Network ## Action Markers",
    "slug": "docs/advanced/example-setups"
  },
  {
    "title": "IP + HDMI",
    "content": "",
    "slug": "docs/advanced/example-setups#ip-hdmi"
  },
  {
    "title": "Full Network",
    "content": "",
    "slug": "docs/advanced/example-setups#full-network"
  },
  {
    "title": "Action Markers",
    "content": "",
    "slug": "docs/advanced/example-setups#action-markers"
  }
]